Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_esmc.c
/**
  ******************************************************************************
  * @file    py32e407_hal_esmc.c
  * @author  MCU Application Team
  * @brief   ESMC HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the ESMC interface.
  *           + Initialization and de-initialization functions
  *           + Indirect functional mode management
  *           + Memory-mapped functional mode management
  *           + Memory-write functional mode management
  *           + Interrupts and flags management
  *           + DMA channel configuration for indirect functional mode
  *           + Errors management and abort functionality
  *
  *
  @verbatim
 ===============================================================================
  @endverbatim
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by Puya under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */


/* Includes ------------------------------------------------------------------*/
#include "py32e4xx_hal.h"

/** @addtogroup PY32E407_HAL_Driver
  * @{
  */

/** @defgroup ESMC ESMC
  * @brief HAL ESMC module driver
  * @{
  */
#ifdef HAL_ESMC_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/** @addtogroup ESMC_Private_Constants
  * @{
  */
#define ESMC_FUNCTIONAL_MODE_INDIRECT_READ_WRITE       0x00000000U   /*!<Indirect write or read mode*/
#define ESMC_FUNCTIONAL_MODE_INDIRECT_INSTRUCT         0x00000001U   /*!<Indirect only send instruction mode*/
#define ESMC_FUNCTIONAL_MODE_MEMORY_MAPPED             0x00000002U   /*!<Memory-mapped mode*/
#define ESMC_FUNCTIONAL_MODE_MEMORY_WRITE              0x00000003U   /*!<Memory-write mode*/
/**
  * @}
  */

/* Private macro -------------------------------------------------------------*/
/** @addtogroup ESMC_Private_Macros ESMC Private Macros
  * @{
  */
#define IS_ESMC_FUNCTIONAL_MODE(MODE) (((MODE) == ESMC_FUNCTIONAL_MODE_INDIRECT_READ_WRITE)    || \
                                       ((MODE) == ESMC_FUNCTIONAL_MODE_INDIRECT_INSTRUCT) || \
                                       ((MODE) == ESMC_FUNCTIONAL_MODE_MEMORY_MAPPED) || \
                                       ((MODE) == ESMC_FUNCTIONAL_MODE_MEMORY_WRITE))
/**
  * @}
  */

/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/** @addtogroup ESMC_Private_Functions ESMC Private Functions
  * @{
  */
static void ESMC_DMARxCplt(DMA_HandleTypeDef *hdma);
static void ESMC_DMATxCplt(DMA_HandleTypeDef *hdma);
static void ESMC_DMARxHalfBlockCplt(DMA_HandleTypeDef *hdma);
static void ESMC_DMATxHalfBlockCplt(DMA_HandleTypeDef *hdma);
static void ESMC_DMAError(DMA_HandleTypeDef *hdma);
static void ESMC_DMAAbortCplt(DMA_HandleTypeDef *hdma);
HAL_StatusTypeDef ESMC_WaitFlagStateUntilTimeout(ESMC_HandleTypeDef *hesmc, uint32_t Flag, FlagStatus State, uint32_t tickstart, uint32_t Timeout);
static void ESMC_Config(ESMC_HandleTypeDef *hesmc, ESMC_CommandTypeDef *cmd, uint32_t FunctionalMode);
static void ESMC_WriteBuff(ESMC_HandleTypeDef *hesmc, uint8_t *pData, uint8_t dataLen);
void ESMC_ReadBuff(ESMC_HandleTypeDef *hesmc, uint8_t *pData, uint8_t dataLen);


/* Exported functions ---------------------------------------------------------*/

/** @defgroup ESMC_Exported_Functions ESMC Exported Functions
  * @{
  */

/** @defgroup ESMC_Exported_Functions_Group1 Initialization/de-initialization functions
  *  @brief    Initialization and Configuration functions
  *
@verbatim
===============================================================================
            ##### Initialization and Configuration functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to :
      (+) Initialize the ESMC.
      (+) De-initialize the ESMC.

@endverbatim
  * @{
  */

/**
  * @brief Initializes the ESMC mode according to the specified parameters
  *        in the ESMC_InitTypeDef and creates the associated handle.
  * @param hesmc esmc handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ESMC_Init(ESMC_HandleTypeDef *hesmc)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t tickstart = HAL_GetTick();

  /* Check the ESMC handle allocation */
  if(hesmc == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_ESMC_ALL_INSTANCE(hesmc->Instance));
  assert_param(IS_ESMC_CLOCK_PRESCALER(hesmc->Init.ClockPrescaler));
  assert_param(IS_ESMC_CLOCK_MODE(hesmc->Init.ClockMode));
  assert_param(IS_ESMC_DUAL_FLASH_MODE(hesmc->Init.DualFlash));
  assert_param(IS_ESMC_CS_HIGH_TIME(hesmc->Init.ChipSelectHighTime));
  assert_param(IS_ESMC_CS_HOLD_TIME(hesmc->Init.ChipSelectHoldTime));

  /* Process locked */
  __HAL_LOCK(hesmc);

  if(hesmc->State == HAL_ESMC_STATE_RESET)
  {
    /* Allocate lock resource and initialize it */
    hesmc->Lock = HAL_UNLOCKED;

#if (USE_HAL_ESMC_REGISTER_CALLBACKS == 1)
    /* Reset Callback pointers in HAL_ESMC_STATE_RESET only */
    hesmc->ErrorCallback         = HAL_ESMC_ErrorCallback;
    hesmc->AbortCpltCallback     = HAL_ESMC_AbortCpltCallback;
    hesmc->CmdCpltCallback       = HAL_ESMC_CmdCpltCallback;
    hesmc->RxCpltCallback        = HAL_ESMC_RxCpltCallback;
    hesmc->TxCpltCallback        = HAL_ESMC_TxCpltCallback;
    hesmc->RxHalfBlockCpltCallback    = HAL_ESMC_RxHalfBlockCpltCallback;
    hesmc->TxHalfBlockCpltCallback    = HAL_ESMC_TxHalfBlockCpltCallback;

    if(hesmc->MspInitCallback == NULL)
    {
      hesmc->MspInitCallback = HAL_ESMC_MspInit;
    }

    /* Init the low level hardware */
    hesmc->MspInitCallback(hesmc);
#else
    /* Init the low level hardware : GPIO, CLOCK */
    HAL_ESMC_MspInit(hesmc);
#endif

    /* Configure the default timeout for the ESMC memory access */
    HAL_ESMC_SetTimeout(hesmc, HAL_ESMC_TIMEOUT_DEFAULT_VALUE);
  }

