Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_esmc.c
  /* Wait till IDLE flag set */
  status = ESMC_WaitFlagStateUntilTimeout(hesmc, ESMC_FLAG_IDLE, SET, tickstart, hesmc->Timeout);
  
  if(status == HAL_OK)
  {
    /* Set Clock Prescaler */
    MODIFY_REG(hesmc->Instance->BAUD, ESMC_BAUD_BAUD, hesmc->Init.ClockPrescaler);
    
    MODIFY_REG(hesmc->Instance->CR2, ESMC_CR2_CPOL | ESMC_CR2_CPHA, hesmc->Init.ClockMode);
       
    MODIFY_REG(hesmc->Instance->TCR, ESMC_TCR_HOLD | ESMC_TCR_HIGH ,hesmc->Init.ChipSelectHighTime | hesmc->Init.ChipSelectHoldTime);
    
    /* CLEAR ALL CS */
    CLEAR_BIT(hesmc->Instance->ADDR32, ESMC_ADDR32_SSXO);

    /* CLEAR ALL CS */
    CLEAR_BIT(hesmc->Instance->XSSOCR, ESMC_XSSOCR_SSXO);

    /* CLEAR ALL CS */
    CLEAR_BIT(hesmc->Instance->XSSOCR_WE, ESMC_XSSOCR_WE_SSXO);    

    /* Config Dual Flash, Enable ESMC, And reset other bits */
    hesmc->Instance->CR = ESMC_CR_SPIEN | hesmc->Init.DualFlash;

    /* Clear FIFO */
    __HAL_ESMC_CLEAR_FIFO(hesmc);

    /* Initialize the ESMC operation */
    hesmc->Contex = ESMC_CONTEXT_NONE;

    /* Set ESMC error code to none */
    hesmc->ErrorCode = HAL_ESMC_ERROR_NONE;

    /* Initialize the ESMC state */
    hesmc->State = HAL_ESMC_STATE_READY;
  }

  /* Release Lock */
  __HAL_UNLOCK(hesmc);

  /* Return function status */
  return status;
}

/**
  * @brief DeInitializes the ESMC peripheral
  * @param hesmc esmc handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ESMC_DeInit(ESMC_HandleTypeDef *hesmc)
{
  /* Check the ESMC handle allocation */
  if(hesmc == NULL)
  {
    return HAL_ERROR;
  }

  /* Process locked */
  __HAL_LOCK(hesmc);

  /* Disable the slave select */
  __HAL_ESMC_DISABLE_SLAVE(hesmc);

  /* Soft reset ESMC */
  __HAL_ESMC_SOFT_RESET(hesmc);

#if (USE_HAL_ESMC_REGISTER_CALLBACKS == 1)
  if(hesmc->MspDeInitCallback == NULL)
  {
    hesmc->MspDeInitCallback = HAL_ESMC_MspDeInit;
  }

  /* DeInit the low level hardware */
  hesmc->MspDeInitCallback(hesmc);
#else
  /* DeInit the low level hardware: GPIO, CLOCK, NVIC... */
  HAL_ESMC_MspDeInit(hesmc);
#endif

  /* Set ESMC error code to none */
  hesmc->ErrorCode = HAL_ESMC_ERROR_NONE;

  /* Initialize the ESMC state */
  hesmc->State = HAL_ESMC_STATE_RESET;

  /* Release Lock */
  __HAL_UNLOCK(hesmc);

  return HAL_OK;
}

/**
  * @brief ESMC MSP Init
  * @param hesmc ESMC handle
  * @retval None
  */
__weak void HAL_ESMC_MspInit(ESMC_HandleTypeDef *hesmc)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hesmc);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_ESMC_MspInit can be implemented in the user file
   */
}

/**
  * @brief ESMC MSP DeInit
  * @param hesmc ESMC handle
  * @retval None
  */
__weak void HAL_ESMC_MspDeInit(ESMC_HandleTypeDef *hesmc)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hesmc);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_ESMC_MspDeInit can be implemented in the user file
   */
}

/**
  * @}
  */

/** @defgroup ESMC_Exported_Functions_Group2 IO operation functions
  *  @brief ESMC Transmit/Receive functions
  *
@verbatim
 ===============================================================================
                      ##### IO operation functions #####
 ===============================================================================
       [..]
    This subsection provides a set of functions allowing to :
      (+) Handle the interrupts.
      (+) Handle the command sequence.
      (+) Transmit data in blocking, interrupt or DMA mode.
      (+) Receive data in blocking, interrupt or DMA mode.
      (+) Manage the auto-polling functional mode.
      (+) Manage the memory-mapped functional mode.

@endverbatim
  * @{
  */

/**
  * @brief This function handles ESMC interrupt request.
  * @param hesmc ESMC handle
  * @retval None.
  */
void HAL_ESMC_IRQHandler(ESMC_HandleTypeDef *hesmc)
{
  uint32_t flag = *(__IO uint32_t *)(&hesmc->Instance->IFR1);
  uint32_t itsource = *(__IO uint32_t *)(&hesmc->Instance->IER1);
  uint32_t len;

  /* ESMC data wait interrupt occurred ----------------------------------*/
  if(((flag & ESMC_FLAG_DATAWAITIF) != 0U) && ((itsource & ESMC_IT_DATAWAIT) != 0U))
  {
    if(hesmc->State == HAL_ESMC_STATE_BUSY_INDIRECT_TX)
    {
      if (hesmc->TxXferCount == 0U)
      {
        if ((hesmc->Instance->CR & ESMC_CR_DMAEN) != 0U)
        {
          /* Disable the DMA transfer by clearing the DMAEN bit in the ESMC CR register */
          CLEAR_BIT(hesmc->Instance->CR, ESMC_CR_DMAEN);
        }
        /* No more data available for the transfer */
        /* Disable the ESMC datawait Interrupt */
        __HAL_ESMC_DISABLE_IT(hesmc, ESMC_IT_DATAWAIT);
        if (hesmc->Contex == ESMC_CONTEXT_WRITE_VARIABLE_LENGTH)
        {
          /* Disable the slave select */
          __HAL_ESMC_DISABLE_SLAVE(hesmc);

          /* Change state of ESMC */
          hesmc->State = HAL_ESMC_STATE_READY;

          /* Restore default values */
          hesmc->Contex = ESMC_CONTEXT_NONE;

          /* Command Complete callback */
#if (USE_HAL_ESMC_REGISTER_CALLBACKS == 1)
          hesmc->TxCpltCallback(hesmc);
#else
          HAL_ESMC_TxCpltCallback(hesmc);
#endif
        }
      } 
      else
      {
        /* Transmission process */
        if ((hesmc->TxXferCount/HAL_ESMC_FIFO_SIZE) > 0)
        {
          /* The amount of data to be sent is greater than the maximum depth of the FIFO */
          ESMC_WriteBuff(hesmc, hesmc->pTxBuffPtr, HAL_ESMC_FIFO_SIZE);
          hesmc->pTxBuffPtr += HAL_ESMC_FIFO_SIZE;
          hesmc->TxXferCount -= HAL_ESMC_FIFO_SIZE;
        } 
        else
        {
          ESMC_WriteBuff(hesmc, hesmc->pTxBuffPtr, hesmc->TxXferCount);
          hesmc->pTxBuffPtr += hesmc->TxXferCount;
          hesmc->TxXferCount = 0;
        }
      }
    } 
    else if(hesmc->State == HAL_ESMC_STATE_BUSY_INDIRECT_RX)
    {
      /* Transmission process */
      len = (hesmc->RxXferCount > HAL_ESMC_FIFO_SIZE) ? HAL_ESMC_FIFO_SIZE : hesmc->RxXferCount;
      ESMC_ReadBuff(hesmc, hesmc->pRxBuffPtr, len);
      hesmc->pRxBuffPtr += len;
      hesmc->RxXferCount -= len;

      if (hesmc->RxXferCount == 0U)
      {
        /* No more data available for the transfer */
        /* Disable the ESMC datawait Interrupt */
        __HAL_ESMC_DISABLE_IT(hesmc, ESMC_IT_DATAWAIT);
        if (hesmc->Contex == ESMC_CONTEXT_READ_VARIABLE_LENGTH)
        {
          /* Disable the slave select */
          __HAL_ESMC_DISABLE_SLAVE(hesmc);

          /* Change state of ESMC */
          hesmc->State = HAL_ESMC_STATE_READY;

          /* Restore default values */
          hesmc->Contex = ESMC_CONTEXT_NONE;

