Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_esmc.c
          /* Command Complete callback */
#if (USE_HAL_ESMC_REGISTER_CALLBACKS == 1)
          hesmc->RxCpltCallback(hesmc);
#else
          HAL_ESMC_RxCpltCallback(hesmc);
#endif
        }
      }
    }
    else if(hesmc->State == HAL_ESMC_STATE_BUSY)
    {
      /* Disable the ESMC datawait Interrupt */
      __HAL_ESMC_DISABLE_IT(hesmc, ESMC_IT_DATAWAIT);

      /* Disable the slave select */
      __HAL_ESMC_DISABLE_SLAVE(hesmc);

      /* Change state of ESMC */
      hesmc->State = HAL_ESMC_STATE_READY;

      /* Restore default values */
      hesmc->Contex = ESMC_CONTEXT_NONE;

      /* Command Complete callback */
#if (USE_HAL_ESMC_REGISTER_CALLBACKS == 1)
      hesmc->CmdCpltCallback(hesmc);
#else
      HAL_ESMC_CmdCpltCallback(hesmc);
#endif
    }
  }
  else if(((flag & ESMC_FLAG_IDLEDONEIF) != 0U) && ((itsource & ESMC_IT_IDLEDONE) != 0U))
  {
    /* Clear interrupt */
    __HAL_ESMC_CLEAR_FLAG(hesmc, ESMC_FLAG_IDLEDONEIF);

    /* Disable the ESMC idle interrupts and datawait interrupts */
    __HAL_ESMC_DISABLE_IT(hesmc, (ESMC_IT_IDLEDONE | ESMC_IT_DATAWAIT));

    /* Transfer complete callback */
    if(hesmc->State == HAL_ESMC_STATE_BUSY_INDIRECT_TX)
    {
      if ((hesmc->Instance->CR & ESMC_CR_DMAEN) != 0U)
      {
        /* Disable the DMA transfer by clearing the DMAEN bit in the ESMC CR register */
        CLEAR_BIT(hesmc->Instance->CR, ESMC_CR_DMAEN);
      }

      /* Change state of ESMC */
      hesmc->State = HAL_ESMC_STATE_READY;

      /* Restore default values */
      hesmc->Contex = ESMC_CONTEXT_NONE;

      /* TX Complete callback */
#if (USE_HAL_ESMC_REGISTER_CALLBACKS == 1)
      hesmc->TxCpltCallback(hesmc);
#else
      HAL_ESMC_TxCpltCallback(hesmc);
#endif
    }
    else if(hesmc->State == HAL_ESMC_STATE_BUSY_INDIRECT_RX)
    {
      /* Transmission process */
      ESMC_ReadBuff(hesmc, hesmc->pRxBuffPtr, hesmc->RxXferCount);
      hesmc->pRxBuffPtr += hesmc->RxXferCount;
      hesmc->RxXferCount = 0;

      /* Change state of ESMC */
      hesmc->State = HAL_ESMC_STATE_READY;

      /* Restore default values */
      hesmc->Contex = ESMC_CONTEXT_NONE;

      /* RX Complete callback */
#if (USE_HAL_ESMC_REGISTER_CALLBACKS == 1)
      hesmc->RxCpltCallback(hesmc);
#else
      HAL_ESMC_RxCpltCallback(hesmc);
#endif
    }
    else if(hesmc->State == HAL_ESMC_STATE_BUSY)
    {
      /* Change state of ESMC */
      hesmc->State = HAL_ESMC_STATE_READY;

      /* Restore default values */
      hesmc->Contex = ESMC_CONTEXT_NONE;

      /* Command Complete callback */
#if (USE_HAL_ESMC_REGISTER_CALLBACKS == 1)
      hesmc->CmdCpltCallback(hesmc);
#else
      HAL_ESMC_CmdCpltCallback(hesmc);
#endif
    }
    else
    {
      /* Nothing to do */
    }
  }
}

/**
  * @brief Sets the command configuration.
  * @param hesmc ESMC handle
  * @param cmd  structure that contains the command configuration information
  * @param Timeout  Time out duration
  * @note   This function is used only in Indirect Read or Write Modes
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ESMC_Command(ESMC_HandleTypeDef *hesmc, ESMC_CommandTypeDef *cmd, uint32_t Timeout)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t tickstart = HAL_GetTick();

  assert_param(IS_ESMC_INSTRUCTION_MODE(cmd->InstructionMode));

  if (cmd->InstructionMode != ESMC_INSTRUCTION_NONE)
  {
    assert_param(IS_ESMC_INSTRUCTION(cmd->Instruction));
    assert_param(IS_ESMC_INSTRUCTION_LENGTH(cmd->InstrcutionLen));
  }

  assert_param(IS_ESMC_ADDRESS_MODE(cmd->AddressMode));

  if (cmd->AddressMode != ESMC_ADDRESS_NONE)
  {
    assert_param(IS_ESMC_ADDRESS_SIZE(cmd->AddressSize));
  }
  assert_param(IS_ESMC_ALTERNATE_BYTES_MODE(cmd->AlternateByteMode));
  assert_param(IS_ESMC_ALTERNATE_BYTE(cmd->AlternateByte));
  assert_param(IS_ESMC_DUMMY_CYCLES(cmd->DummyCycles));
  assert_param(IS_ESMC_DATA_MODE(cmd->DataMode));
  assert_param(IS_ESMC_DQS_MODE(cmd->DQSMode));
  assert_param(IS_ESMC_SAMPLESHIFTING(cmd->SampleShifting));
  assert_param(IS_ESMC_XSPI_DUALLATENCY(cmd->XspiDualLatency));  

  /* Process locked */
  __HAL_LOCK(hesmc);

  if(hesmc->State == HAL_ESMC_STATE_READY)
  {
    hesmc->ErrorCode = HAL_ESMC_ERROR_NONE;

    /* Update ESMC state */
    hesmc->State = HAL_ESMC_STATE_BUSY;

    status = ESMC_WaitFlagStateUntilTimeout(hesmc, ESMC_FLAG_IDLE, SET, tickstart, Timeout);
    
    if (status == HAL_OK)
    {
      if ((cmd->InstructionMode != ESMC_INSTRUCTION_NONE) && \
          (cmd->AddressMode == ESMC_ADDRESS_NONE) && \
          (cmd->AlternateByteMode == ESMC_ALTERNATE_BYTES_DISABLE)&& \
          (cmd->DataMode == ESMC_DATA_NONE))
      {
        /* Call the configuration function  */
        ESMC_Config(hesmc, cmd, ESMC_FUNCTIONAL_MODE_INDIRECT_INSTRUCT);
        status = ESMC_WaitFlagStateUntilTimeout(hesmc, ESMC_FLAG_IDLEDONEIF, SET, tickstart, Timeout);
        if (status == HAL_OK)
        {
          /* Update ESMC state */
          hesmc->State = HAL_ESMC_STATE_READY;
        }          
      }
      else
      {
        /* Call the configuration function  */
        ESMC_Config(hesmc, cmd, ESMC_FUNCTIONAL_MODE_INDIRECT_READ_WRITE);

        if (cmd->DataMode == ESMC_DATA_NONE)
        {
          status = ESMC_WaitFlagStateUntilTimeout(hesmc, ESMC_FLAG_IDLEDONEIF, SET, tickstart, Timeout);

          if (status == HAL_OK)
          {
            /* Update ESMC state */
            hesmc->State = HAL_ESMC_STATE_READY;
          }          
        }
        else
        {
          hesmc->State = HAL_ESMC_STATE_READY;            
        }
      }
    }
  }
  else
  {
    status = HAL_BUSY;
  }

  /* Process unlocked */
  __HAL_UNLOCK(hesmc);

  /* Return function status */
  return status;
}

/**
  * @brief Set the command configuration in interrupt mode.
  * @param hesmc : ESMC handle
  * @param cmd : structure that contains the command configuration information
  * @note   This function is used only in Indirect Read or Write Modes
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ESMC_Command_IT(ESMC_HandleTypeDef *hesmc, ESMC_CommandTypeDef *cmd)
{
  HAL_StatusTypeDef status;
  uint32_t tickstart = HAL_GetTick();

  assert_param(IS_ESMC_INSTRUCTION_MODE(cmd->InstructionMode));

  if (cmd->InstructionMode != ESMC_INSTRUCTION_NONE)
  {
    assert_param(IS_ESMC_INSTRUCTION(cmd->Instruction));
    assert_param(IS_ESMC_INSTRUCTION_LENGTH(cmd->InstrcutionLen));
  }

  assert_param(IS_ESMC_ADDRESS_MODE(cmd->AddressMode));

  if (cmd->AddressMode != ESMC_ADDRESS_NONE)
  {
    assert_param(IS_ESMC_ADDRESS_SIZE(cmd->AddressSize));
  }
  assert_param(IS_ESMC_ALTERNATE_BYTES_MODE(cmd->AlternateByteMode));
  assert_param(IS_ESMC_ALTERNATE_BYTE(cmd->AlternateByte));
  assert_param(IS_ESMC_DUMMY_CYCLES(cmd->DummyCycles));
  assert_param(IS_ESMC_DATA_MODE(cmd->DataMode));
  assert_param(IS_ESMC_DQS_MODE(cmd->DQSMode));
  assert_param(IS_ESMC_SAMPLESHIFTING(cmd->SampleShifting));
  assert_param(IS_ESMC_XSPI_DUALLATENCY(cmd->XspiDualLatency));  

  /* Process locked */
  __HAL_LOCK(hesmc);

  if(hesmc->State == HAL_ESMC_STATE_READY)
  {
    hesmc->ErrorCode = HAL_ESMC_ERROR_NONE;

    /* Update ESMC state */
    hesmc->State = HAL_ESMC_STATE_BUSY;

    /* Wait till idle state set */
    status = ESMC_WaitFlagStateUntilTimeout(hesmc, ESMC_FLAG_IDLE, SET, tickstart, hesmc->Timeout);

    if (status == HAL_OK)
    {
      if ((cmd->InstructionMode != ESMC_INSTRUCTION_NONE) && \
          (cmd->AddressMode == ESMC_ADDRESS_NONE) && \
          (cmd->AlternateByte == ESMC_ALTERNATE_BYTES_DISABLE)&& \
          (cmd->DataMode == ESMC_DATA_NONE))
      {
        /* Clear idle interrupt */
        __HAL_ESMC_CLEAR_FLAG(hesmc, ESMC_FLAG_IDLEDONEIF);

        /* Call the configuration function  */
        ESMC_Config(hesmc, cmd, ESMC_FUNCTIONAL_MODE_INDIRECT_INSTRUCT);

