Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_esmc.c
        /* Process unlocked */
        __HAL_UNLOCK(hesmc);

        /* Enable the ESMC idle Interrupt */
        __HAL_ESMC_ENABLE_GLOBAL_IT(hesmc);
        __HAL_ESMC_ENABLE_IT(hesmc, ESMC_FLAG_IDLEDONEIF);
      }
      else
      {
        /* Call the configuration function  */
        ESMC_Config(hesmc, cmd, ESMC_FUNCTIONAL_MODE_INDIRECT_READ_WRITE);

        if (cmd->DataMode == ESMC_DATA_NONE)
        {       
          /* Process unlocked */
          __HAL_UNLOCK(hesmc);

          /* Enable the ESMC datawait Interrupt */
          __HAL_ESMC_ENABLE_GLOBAL_IT(hesmc);
          __HAL_ESMC_ENABLE_IT(hesmc, ESMC_FLAG_IDLEDONEIF);
        } 
        else
        {
          /* Update ESMC state */
          hesmc->State = HAL_ESMC_STATE_READY;

          /* Process unlocked */
          __HAL_UNLOCK(hesmc);
        }
      }
    }
  }
  else
  {
    status = HAL_BUSY;

    /* Process unlocked */
    __HAL_UNLOCK(hesmc);
  }

  /* Return function status */
  return status;
}

/**
  * @brief  Configure the Memory Mapped mode.
  * @param  hesmc : ESMC handle
  * @param  cmd : structure that contains the command configuration information.
  * @note   This function is used only in Memory mapped Mode
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ESMC_MemoryMapped(ESMC_HandleTypeDef *hesmc, ESMC_CommandTypeDef *cmd)
{
  HAL_StatusTypeDef status;
  uint32_t tickstart = HAL_GetTick();

  assert_param(IS_ESMC_INSTRUCTION_MODE(cmd->InstructionMode));

  if (cmd->InstructionMode != ESMC_INSTRUCTION_NONE)
  {
    assert_param(IS_ESMC_INSTRUCTION(cmd->Instruction));
    assert_param(IS_ESMC_INSTRUCTION_LENGTH(cmd->InstrcutionLen));
  }

  assert_param(IS_ESMC_ADDRESS_MODE(cmd->AddressMode));

  if (cmd->AddressMode != ESMC_ADDRESS_NONE)
  {
    assert_param(IS_ESMC_ADDRESS_SIZE(cmd->AddressSize));
  }
  assert_param(IS_ESMC_ALTERNATE_BYTES_MODE(cmd->AlternateByteMode));
  assert_param(IS_ESMC_ALTERNATE_BYTE(cmd->AlternateByte));
  assert_param(IS_ESMC_DUMMY_CYCLES(cmd->DummyCycles));
  assert_param(IS_ESMC_DATA_MODE(cmd->DataMode));
  assert_param(IS_ESMC_DQS_MODE(cmd->DQSMode));
  assert_param(IS_ESMC_SAMPLESHIFTING(cmd->SampleShifting));
  assert_param(IS_ESMC_XSPI_DUALLATENCY(cmd->XspiDualLatency));  

  /* Process locked */
  __HAL_LOCK(hesmc);

  if(hesmc->State == HAL_ESMC_STATE_READY  || hesmc->State == HAL_ESMC_STATE_BUSY_MEM_WRITE )
  {
    hesmc->ErrorCode = HAL_ESMC_ERROR_NONE;
    
    if(hesmc->State == HAL_ESMC_STATE_READY)
    {
      /* Update state */
      hesmc->State = HAL_ESMC_STATE_BUSY_MEM_MAPPED;
    }
    else
    {
       /* Update state */
      hesmc->State = HAL_ESMC_STATE_BUSY_MEM_WRITEANDMAPPED;    
    }

    /* Wait till IDLE flag set */
    status = ESMC_WaitFlagStateUntilTimeout(hesmc, ESMC_FLAG_IDLE, SET, tickstart, hesmc->Timeout);

    if (status == HAL_OK)
    {
      /* Disable XIP mode, DMA, global interrupt */
      CLEAR_BIT(hesmc->Instance->CR, (ESMC_CR_XIPEN | ESMC_CR_DMAEN | ESMC_CR_GIE));

      /* Call the configuration function */
      ESMC_Config(hesmc, cmd, ESMC_FUNCTIONAL_MODE_MEMORY_MAPPED);

      /* Enable XIP mode */
      SET_BIT(hesmc->Instance->CR, ESMC_CR_XIPEN);

      /* Enable the slave select */
      __HAL_ESMC_ENABLE_SLAVE(hesmc);
    }
  }
  else
  {
    status = HAL_BUSY;
  }

  /* Process unlocked */
  __HAL_UNLOCK(hesmc);

  /* Return function status */
  return status;
}


/**
  * @brief  Configure the Memory Mapped mode.
  * @param  hesmc : ESMC handle
  * @param  cmd : structure that contains the command configuration information.
  * @note   This function is used only in Memory mapped Mode
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ESMC_MemoryWrite(ESMC_HandleTypeDef *hesmc, ESMC_CommandTypeDef *cmd)
{
  HAL_StatusTypeDef status;
  uint32_t tickstart = HAL_GetTick();

  assert_param(IS_ESMC_INSTRUCTION_MODE(cmd->InstructionMode));

  if (cmd->InstructionMode != ESMC_INSTRUCTION_NONE)
  {
    assert_param(IS_ESMC_INSTRUCTION(cmd->Instruction));
    assert_param(IS_ESMC_INSTRUCTION_LENGTH(cmd->InstrcutionLen));
  }

  assert_param(IS_ESMC_ADDRESS_MODE(cmd->AddressMode));

  if (cmd->AddressMode != ESMC_ADDRESS_NONE)
  {
    assert_param(IS_ESMC_ADDRESS_SIZE(cmd->AddressSize));
  }
  assert_param(IS_ESMC_ALTERNATE_BYTES_MODE(cmd->AlternateByteMode));
  assert_param(IS_ESMC_ALTERNATE_BYTE(cmd->AlternateByte));
  assert_param(IS_ESMC_DUMMY_CYCLES(cmd->DummyCycles));
  assert_param(IS_ESMC_DATA_MODE(cmd->DataMode));
  assert_param(IS_ESMC_DQS_MODE(cmd->DQSMode));
  assert_param(IS_ESMC_SAMPLESHIFTING(cmd->SampleShifting));
  assert_param(IS_ESMC_XSPI_DUALLATENCY(cmd->XspiDualLatency));  

  /* Process locked */
  __HAL_LOCK(hesmc);

  if(hesmc->State == HAL_ESMC_STATE_READY || hesmc->State == HAL_ESMC_STATE_BUSY_MEM_MAPPED)
  {
    hesmc->ErrorCode = HAL_ESMC_ERROR_NONE;

    if(hesmc->State == HAL_ESMC_STATE_READY)
    {
      /* Update state */
      hesmc->State = HAL_ESMC_STATE_BUSY_MEM_WRITE;
    }
    else
    {
      /* Update state */
      hesmc->State = HAL_ESMC_STATE_BUSY_MEM_WRITEANDMAPPED;    
    }

    /* Wait till IDLE flag set */
    status = ESMC_WaitFlagStateUntilTimeout(hesmc, ESMC_FLAG_IDLE, SET, tickstart, hesmc->Timeout);

    if (status == HAL_OK)
    {
      /* Disable XIP mode, DMA, global interrupt */
      CLEAR_BIT(hesmc->Instance->CR, (ESMC_CR_XIPEN | ESMC_CR_DMAEN | ESMC_CR_GIE));

      /* Call the configuration function */
      ESMC_Config(hesmc, cmd, ESMC_FUNCTIONAL_MODE_MEMORY_WRITE);

      /* Enable XIP mode */
      SET_BIT(hesmc->Instance->CR, ESMC_CR_XIPEN);

      /* Enable the slave select */
      __HAL_ESMC_ENABLE_SLAVE(hesmc);
    }
  }
  else
  {
    status = HAL_BUSY;
  }

  /* Process unlocked */
  __HAL_UNLOCK(hesmc);

  /* Return function status */
  return status;
}

/**
  * @brief Transmit an amount of data in blocking mode.
  * @param hesmc ESMC handle
  * @param pData pointer to data buffer
  * @param Timeout  Time out duration
  * @note   This function is used only in Indirect Write Mode
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ESMC_Transmit(ESMC_HandleTypeDef *hesmc, uint8_t *pData, uint32_t Timeout)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t tickstart = HAL_GetTick();

  /* Process locked */
  __HAL_LOCK(hesmc);

  if(hesmc->State == HAL_ESMC_STATE_READY)
  {
    hesmc->ErrorCode = HAL_ESMC_ERROR_NONE;

    if((pData != NULL) && (hesmc->TxXferCount != 0) && (hesmc->TxXferSize != 0))
    {
      /* Update state */
      hesmc->State = HAL_ESMC_STATE_BUSY_INDIRECT_TX;

      hesmc->pTxBuffPtr = pData;
           
      hesmc->Instance->ADDR24 = hesmc->ContexAddr24;
      
      status = ESMC_WaitFlagStateUntilTimeout(hesmc, ESMC_FLAG_DATAWAITIF, SET, tickstart, Timeout);  

      while(hesmc->TxXferCount != 0U)
      {
        if (hesmc->TxXferCount > HAL_ESMC_FIFO_SIZE)
        {
          ESMC_WriteBuff(hesmc, hesmc->pTxBuffPtr, HAL_ESMC_FIFO_SIZE);
        
