Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_esmc.c
          hesmc->pTxBuffPtr += HAL_ESMC_FIFO_SIZE;
          hesmc->TxXferCount -= HAL_ESMC_FIFO_SIZE;
          status = ESMC_WaitFlagStateUntilTimeout(hesmc, ESMC_FLAG_DATAWAITIF, SET, tickstart, Timeout);          
        } 
        else
        {
          ESMC_WriteBuff(hesmc, hesmc->pTxBuffPtr, hesmc->TxXferCount);
          hesmc->pTxBuffPtr += hesmc->TxXferCount;
          hesmc->TxXferCount = 0;
          if(hesmc->Contex == ESMC_CONTEXT_WRITE_FIXED_LENGTH)
          {
            status = ESMC_WaitFlagStateUntilTimeout(hesmc, ESMC_FLAG_IDLEDONEIF, SET, tickstart, Timeout);
          }
          else
          {
            status = ESMC_WaitFlagStateUntilTimeout(hesmc, ESMC_FLAG_DATAWAITIF, SET, tickstart, Timeout);
          }
        }
        if (status != HAL_OK)
        {
          break;
        }
      }

       /* Disable the slave select */
      __HAL_ESMC_DISABLE_SLAVE(hesmc);

      /* Update ESMC state */
      hesmc->State = HAL_ESMC_STATE_READY;
    }
    else
    {
      hesmc->ErrorCode |= HAL_ESMC_ERROR_INVALID_PARAM;
      status = HAL_ERROR;
    }
  }
  else
  {
    status = HAL_BUSY;
  }

  /* Process unlocked */
  __HAL_UNLOCK(hesmc);

  return status;
}

/**
  * @brief Transmit an amount of data in blocking mode with FIFO Half Empty.
  * @param hesmc ESMC handle
  * @param pData pointer to data buffer
  * @param Timeout  Time out duration
  * @note   This function is used only in Indirect Write Mode
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ESMC_TransmitFIFO(ESMC_HandleTypeDef *hesmc, uint8_t *pData, uint32_t Timeout)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t tickstart = HAL_GetTick();

  /* Process locked */
  __HAL_LOCK(hesmc);

  if(hesmc->State == HAL_ESMC_STATE_READY)
  {
    hesmc->ErrorCode = HAL_ESMC_ERROR_NONE;

    if((pData != NULL) && (hesmc->TxXferCount != 0) && (hesmc->TxXferSize != 0))
    {
      /* Update state */
      hesmc->State = HAL_ESMC_STATE_BUSY_INDIRECT_TX;

      hesmc->pTxBuffPtr = pData;
           
      hesmc->Instance->ADDR24 = hesmc->ContexAddr24;

      status = ESMC_WaitFlagStateUntilTimeout(hesmc, ESMC_FLAG_TXFIFOHEIF, SET, tickstart, Timeout);
      
      while(hesmc->TxXferCount != 0U)
      {
        if (hesmc->TxXferCount>(HAL_ESMC_FIFO_SIZE/2))
        {
          ESMC_WriteBuff(hesmc, hesmc->pTxBuffPtr, (HAL_ESMC_FIFO_SIZE/2));
        
          hesmc->pTxBuffPtr += (HAL_ESMC_FIFO_SIZE/2);
          hesmc->TxXferCount -= (HAL_ESMC_FIFO_SIZE/2); 
          status = ESMC_WaitFlagStateUntilTimeout(hesmc, ESMC_FLAG_TXFIFOHEIF, SET, tickstart, Timeout);
        } 
        else
        {
          ESMC_WriteBuff(hesmc, hesmc->pTxBuffPtr, hesmc->TxXferCount);
          hesmc->pTxBuffPtr += hesmc->TxXferCount;
          hesmc->TxXferCount = 0;
          if(hesmc->Contex == ESMC_CONTEXT_WRITE_FIXED_LENGTH)
          {
            status = ESMC_WaitFlagStateUntilTimeout(hesmc, ESMC_FLAG_IDLEDONEIF, SET, tickstart, Timeout);
          }
          else
          {
            status = ESMC_WaitFlagStateUntilTimeout(hesmc, ESMC_FLAG_DATAWAITIF, SET, tickstart, Timeout);
          }
        }
        if (status != HAL_OK)
        {
          break;
        }
      }

      __HAL_ESMC_DISABLE_SLAVE(hesmc);

      /* Update ESMC state */
      hesmc->State = HAL_ESMC_STATE_READY;
    }
    else
    {
      hesmc->ErrorCode |= HAL_ESMC_ERROR_INVALID_PARAM;
      status = HAL_ERROR;
    }
  }
  else
  {
    status = HAL_BUSY;
  }

  /* Process unlocked */
  __HAL_UNLOCK(hesmc);

  return status;
}


/**
  * @brief Receive an amount of data in blocking mode
  * @param hesmc ESMC handle
  * @param pData pointer to data buffer
  * @param Timeout  Time out duration
  * @note   This function is used only in Indirect Read Mode
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ESMC_Receive(ESMC_HandleTypeDef *hesmc, uint8_t *pData, uint32_t Timeout)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t tickstart = HAL_GetTick();

  /* Process locked */
  __HAL_LOCK(hesmc);

  if(hesmc->State == HAL_ESMC_STATE_READY)
  {
    hesmc->ErrorCode = HAL_ESMC_ERROR_NONE;

    if((pData != NULL) && (hesmc->RxXferCount != 0) && (hesmc->RxXferSize != 0))
    {
      /* Update state */
      hesmc->State = HAL_ESMC_STATE_BUSY_INDIRECT_RX;

      hesmc->pRxBuffPtr = pData;

      /* send command */
      hesmc->Instance->ADDR24 = hesmc->ContexAddr24;
      
      while (hesmc->RxXferCount > HAL_ESMC_FIFO_SIZE)
      {     
        /* Wait until datawait flag is set */
        status = ESMC_WaitFlagStateUntilTimeout(hesmc, ESMC_FLAG_DATAWAITIF, SET, tickstart, Timeout);

        if(status != HAL_OK)
        {
          break;
        }
        
        ESMC_ReadBuff(hesmc, hesmc->pRxBuffPtr, HAL_ESMC_FIFO_SIZE);
        hesmc->pRxBuffPtr += HAL_ESMC_FIFO_SIZE;
        hesmc->RxXferCount -= HAL_ESMC_FIFO_SIZE;
      }
      if(status == HAL_OK)
      {      
        while (hesmc->RxXferCount != 0)
        {
          if (hesmc->Contex == ESMC_CONTEXT_READ_FIXED_LENGTH)
          {
            /* Wait until idle flag is set */
            status = ESMC_WaitFlagStateUntilTimeout(hesmc, ESMC_FLAG_IDLEDONEIF, SET, tickstart, Timeout);
            if(status != HAL_OK)
            {
              break;
            }
          } 
          else if (hesmc->Contex == ESMC_CONTEXT_READ_VARIABLE_LENGTH)
          {
            /* Wait until datawait flag is set */
            status = ESMC_WaitFlagStateUntilTimeout(hesmc, ESMC_FLAG_DATAWAITIF, SET, tickstart, Timeout);
            if(status != HAL_OK)
            {
              break;
            }
          }
          ESMC_ReadBuff(hesmc, hesmc->pRxBuffPtr, hesmc->RxXferCount);
          hesmc->pRxBuffPtr += hesmc->RxXferCount;
          hesmc->RxXferCount = 0;
        }
      }

      /* Disable the slave select */
      __HAL_ESMC_DISABLE_SLAVE(hesmc);
      
      if(status == HAL_OK)
      {
        /* Update ESMC state */
        hesmc->State = HAL_ESMC_STATE_READY;
      }
    }
    else
    {
      hesmc->ErrorCode |= HAL_ESMC_ERROR_INVALID_PARAM;
      status = HAL_ERROR;
    }
  }
  else
  {
    status = HAL_BUSY;
  }

