Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_esmc.c
  /* Process unlocked */
  __HAL_UNLOCK(hesmc);

  return status;
}

/**
  * @brief Receive an amount of data in blocking mode with FIFO Half Full
  * @param hesmc ESMC handle
  * @param pData pointer to data buffer
  * @param Timeout  Time out duration
  * @note   This function is used only in Indirect Read Mode
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ESMC_ReceiveFIFO(ESMC_HandleTypeDef *hesmc, uint8_t *pData, uint32_t Timeout)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t tickstart = HAL_GetTick();

  /* Process locked */
  __HAL_LOCK(hesmc);

  if(hesmc->State == HAL_ESMC_STATE_READY)
  {
    hesmc->ErrorCode = HAL_ESMC_ERROR_NONE;

    if((pData != NULL) && (hesmc->RxXferCount != 0) && (hesmc->RxXferSize != 0))
    {
      /* Update state */
      hesmc->State = HAL_ESMC_STATE_BUSY_INDIRECT_RX;

      hesmc->pRxBuffPtr = pData;

      /* send command */
      hesmc->Instance->ADDR24 = hesmc->ContexAddr24;
      
      while ((hesmc->RxXferCount/(HAL_ESMC_FIFO_SIZE/2)) > 0U)
      {   
        /* Wait until fifo half full flag is set */
        status= ESMC_WaitFlagStateUntilTimeout(hesmc, ESMC_FLAG_RXFIFOHIF, SET, tickstart, Timeout);
        if(status != HAL_OK)
        {
          break;
        }
        ESMC_ReadBuff(hesmc, hesmc->pRxBuffPtr, HAL_ESMC_FIFO_SIZE/2);
        hesmc->pRxBuffPtr += (HAL_ESMC_FIFO_SIZE/2);
        hesmc->RxXferCount -= (HAL_ESMC_FIFO_SIZE/2);
      }
      if(status == HAL_OK)
      {
        while (hesmc->RxXferCount != 0)
        {
          if (hesmc->Contex == ESMC_CONTEXT_READ_FIXED_LENGTH)
          {
            /* Wait until idle flag is set */
            status = ESMC_WaitFlagStateUntilTimeout(hesmc, ESMC_FLAG_IDLEDONEIF, SET, tickstart, Timeout);
            if(status != HAL_OK)
            {
              break;
            }
          } 
          else if (hesmc->Contex == ESMC_CONTEXT_READ_VARIABLE_LENGTH)
          {
            /* Wait until fifo full flag is set */
            status = ESMC_WaitFlagStateUntilTimeout(hesmc, ESMC_FLAG_RXFIFOFIF, SET, tickstart, Timeout);
            if(status != HAL_OK)
            {
              break;
            }
          }
          ESMC_ReadBuff(hesmc, hesmc->pRxBuffPtr, hesmc->RxXferCount);
          hesmc->pRxBuffPtr += hesmc->RxXferCount;
          hesmc->RxXferCount = 0;
        }
      }

      /* Disable the slave select */
      __HAL_ESMC_DISABLE_SLAVE(hesmc);
      
      if(status == HAL_OK)
      {
        /* Update ESMC state */
        hesmc->State = HAL_ESMC_STATE_READY;
      }
    }
    else
    {
      hesmc->ErrorCode |= HAL_ESMC_ERROR_INVALID_PARAM;
      status = HAL_ERROR;
    }
  }
  else
  {
    status = HAL_BUSY;
  }

  /* Process unlocked */
  __HAL_UNLOCK(hesmc);

  return status;
}


/**
  * @brief  Send an amount of data in interrupt mode
  * @param  hesmc ESMC handle
  * @param  pData pointer to data buffer
  * @note   This function is used only in Indirect Write Mode
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ESMC_Transmit_IT(ESMC_HandleTypeDef *hesmc, uint8_t *pData)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Process locked */
  __HAL_LOCK(hesmc);

  if(hesmc->State == HAL_ESMC_STATE_READY)
  {
    hesmc->ErrorCode = HAL_ESMC_ERROR_NONE;

    if((pData != NULL) && (hesmc->TxXferCount != 0) && (hesmc->TxXferSize != 0))
    {
      /* Update state */
      hesmc->State = HAL_ESMC_STATE_BUSY_INDIRECT_TX;

      hesmc->pTxBuffPtr = pData;
      
      /* send command */
      hesmc->Instance->ADDR24 = hesmc->ContexAddr24;

      /* Process unlocked */
      __HAL_UNLOCK(hesmc);

      /* Enable the ESMC Interrupt */
      __HAL_ESMC_ENABLE_GLOBAL_IT(hesmc);

      if (hesmc->Contex == ESMC_CONTEXT_WRITE_FIXED_LENGTH)
      {
        __HAL_ESMC_ENABLE_IT(hesmc, (ESMC_IT_DATAWAIT | ESMC_IT_IDLEDONE));
      } 
      else
      {
        __HAL_ESMC_ENABLE_IT(hesmc, ESMC_IT_DATAWAIT);
      }
    }
    else
    {
      hesmc->ErrorCode |= HAL_ESMC_ERROR_INVALID_PARAM;
      status = HAL_ERROR;

      /* Process unlocked */
      __HAL_UNLOCK(hesmc);
    }
  }
  else
  {
    status = HAL_BUSY;

    /* Process unlocked */
    __HAL_UNLOCK(hesmc);
  }

  return status;
}

/**
  * @brief  Receive an amount of data in no-blocking mode with Interrupt
  * @param  hesmc ESMC handle
  * @param  pData pointer to data buffer
  * @note   This function is used only in Indirect Read Mode
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ESMC_Receive_IT(ESMC_HandleTypeDef *hesmc, uint8_t *pData)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Process locked */
  __HAL_LOCK(hesmc);

  if(hesmc->State == HAL_ESMC_STATE_READY)
  {
    hesmc->ErrorCode = HAL_ESMC_ERROR_NONE;

    if((pData != NULL) && (hesmc->RxXferCount != 0) && (hesmc->RxXferSize != 0))
    {
      /* Update state */
      hesmc->State = HAL_ESMC_STATE_BUSY_INDIRECT_RX;

      hesmc->pRxBuffPtr = pData;

      /* send command */
      hesmc->Instance->ADDR24 = hesmc->ContexAddr24;

      /* Process unlocked */
      __HAL_UNLOCK(hesmc);

      /* Enable the ESMC Interrupt */
      __HAL_ESMC_ENABLE_GLOBAL_IT(hesmc);

      if (hesmc->Contex == ESMC_CONTEXT_READ_FIXED_LENGTH)
      {
        __HAL_ESMC_ENABLE_IT(hesmc, (ESMC_IT_DATAWAIT | ESMC_IT_IDLEDONE));
      } 
      else
      {
        __HAL_ESMC_ENABLE_IT(hesmc, ESMC_IT_DATAWAIT);
      }
    }
    else
    {
      hesmc->ErrorCode |= HAL_ESMC_ERROR_INVALID_PARAM;
      status = HAL_ERROR;

      /* Process unlocked */
      __HAL_UNLOCK(hesmc);
    }
  }
  else
  {
    status = HAL_BUSY;

    /* Process unlocked */
    __HAL_UNLOCK(hesmc);
  }

  return status;
}

/**
  * @brief  Sends an amount of data in non blocking mode with DMA.
  * @param  hesmc ESMC handle
  * @param  pData pointer to data buffer
  * @note   This function is used only in Indirect Write Mode
  * @note   If DMA peripheral access is configured as halfword, the number
  *         of data and the fifo threshold should be aligned on halfword
  * @note   If DMA peripheral access is configured as word, the number
  *         of data and the fifo threshold should be aligned on word
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ESMC_Transmit_DMA(ESMC_HandleTypeDef *hesmc, uint8_t *pData)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t *pData32 = (uint32_t *)pData;

  /* Process locked */
  __HAL_LOCK(hesmc);

  if(hesmc->State == HAL_ESMC_STATE_READY)
  {
    /* Clear the error code */
    hesmc->ErrorCode = HAL_ESMC_ERROR_NONE;

    if((pData != NULL) && (hesmc->TxXferCount != 0) && (hesmc->TxXferSize != 0))
    {
      /* Configure counters of the handle */
      if ((hesmc->hdmatx->Init.DstWidth == DMA_DST_WIDTH_WORD) && ((hesmc->TxXferSize % 4U) == 0U))
      {
        hesmc->TxXferCount = (hesmc->TxXferSize >> 2U);
      }
      else if((hesmc->hdmatx->Init.DstWidth == DMA_DST_WIDTH_HALFWORD)&&((hesmc->TxXferSize % 2U) == 0U) )
      {
        hesmc->TxXferCount = (hesmc->TxXferSize >> 1U );     
      }    
      else if(hesmc->hdmatx->Init.DstWidth == DMA_DST_WIDTH_BYTE)
      {
        hesmc->TxXferCount = (hesmc->TxXferSize);
      }      
      else
      {
        /* The number of data is not aligned on word
        => no transfer possible with DMA peripheral access configured as word */
        hesmc->ErrorCode |= HAL_ESMC_ERROR_INVALID_PARAM;
        status = HAL_ERROR;

