Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_esmc.c
        /* Process unlocked */
        __HAL_UNLOCK(hesmc);
      }

      if (status == HAL_OK)
      {
        /* Update state */
        hesmc->State = HAL_ESMC_STATE_BUSY_INDIRECT_TX;

        /* Configure size and pointer of the handle */
        hesmc->TxXferSize = hesmc->TxXferCount;
        hesmc->pTxBuffPtr = pData;

        /* Set the ESMC DMA transfer complete callback */
        hesmc->hdmatx->XferCpltCallback = ESMC_DMATxCplt;

        /* Set the ESMC DMA Half Block transfer complete callback */
        hesmc->hdmatx->XferHalfBlockCpltCallback = ESMC_DMATxHalfBlockCplt;

        /* Set the DMA error callback */
        hesmc->hdmatx->XferErrorCallback = ESMC_DMAError;

        /* Clear the DMA abort callback */
        hesmc->hdmatx->XferAbortCallback = NULL;

        /* Configure the direction of the DMA */
        hesmc->hdmatx->Init.Direction = DMA_MEMORY_TO_PERIPH;
      
        hesmc->Instance->ADDR24 = hesmc->ContexAddr24;
       
        SET_BIT(hesmc->Instance->CR, ESMC_CR_DMAEN);
        
        /* Enable the ESMC transmit DMA Channel */
        if (HAL_DMA_Start_IT(hesmc->hdmatx, (uint32_t)pData32, (uint32_t)&hesmc->Instance->DATA, hesmc->TxXferSize) == HAL_OK)
        {
          /* Process unlocked */
          __HAL_UNLOCK(hesmc);

        }
        else
        {
          status = HAL_ERROR;
          hesmc->ErrorCode |= HAL_ESMC_ERROR_DMA;
          hesmc->State = HAL_ESMC_STATE_READY;

          /* Process unlocked */
          __HAL_UNLOCK(hesmc);
        }
      }
    }
    else
    {
      hesmc->ErrorCode |= HAL_ESMC_ERROR_INVALID_PARAM;
      status = HAL_ERROR;

      /* Process unlocked */
      __HAL_UNLOCK(hesmc);
    }
  }
  else
  {
    status = HAL_BUSY;

    /* Process unlocked */
    __HAL_UNLOCK(hesmc);
  }

  return status;
}




/**
  * @brief  Receives an amount of data in non blocking mode with DMA.
  * @param  hesmc ESMC handle
  * @param  pData pointer to data buffer.
  * @note   This function is used only in Indirect Read Mode
  * @note   If DMA peripheral access is configured as halfword, the number
  *         of data and the fifo threshold should be aligned on halfword
  * @note   If DMA peripheral access is configured as word, the number
  *         of data and the fifo threshold should be aligned on word
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ESMC_Receive_DMA(ESMC_HandleTypeDef *hesmc, uint8_t *pData)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Process locked */
  __HAL_LOCK(hesmc);

  if(hesmc->State == HAL_ESMC_STATE_READY)
  {
    /* Clear the error code */
    hesmc->ErrorCode = HAL_ESMC_ERROR_NONE;

    if((pData != NULL) && (hesmc->RxXferCount != 0) && (hesmc->RxXferSize != 0))
    {
      /* Configure counters of the handle */
      if ((hesmc->hdmarx->Init.SrcWidth == DMA_SRC_WIDTH_WORD) && ((hesmc->RxXferSize % 4U) == 0U))
      {
        hesmc->RxXferCount = (hesmc->RxXferSize >> 2U);
      }
      else
      {
        /* The number of data is not aligned on word
             => no transfer possible with DMA peripheral access configured as word */
        hesmc->ErrorCode |= HAL_ESMC_ERROR_INVALID_PARAM;
        status = HAL_ERROR;

        /* Process unlocked */
        __HAL_UNLOCK(hesmc);
      }

      if (status == HAL_OK)
      {
        /* Update state */
        hesmc->State = HAL_ESMC_STATE_BUSY_INDIRECT_RX;

        /* Configure size and pointer of the handle */
        hesmc->RxXferSize = hesmc->RxXferCount;
        hesmc->pRxBuffPtr = pData;
                   
        /* Set the ESMC DMA transfer complete callback */
        hesmc->hdmarx->XferCpltCallback = ESMC_DMARxCplt;

        /* Set the ESMC DMA Half block transfer complete callback */
        hesmc->hdmarx->XferHalfBlockCpltCallback = ESMC_DMARxHalfBlockCplt;

        /* Set the DMA error callback */
        hesmc->hdmarx->XferErrorCallback = ESMC_DMAError;

        /* Clear the DMA abort callback */
        hesmc->hdmarx->XferAbortCallback = NULL;

        /* Configure the direction of the DMA */
        hesmc->hdmarx->Init.Direction = DMA_PERIPH_TO_MEMORY;

        /* Enable the DMA Channel */
        if (HAL_DMA_Start_IT(hesmc->hdmarx, (uint32_t)&hesmc->Instance->DATA, (uint32_t)pData, hesmc->RxXferSize) == HAL_OK)
        {
         /* Process unlocked */
          __HAL_UNLOCK(hesmc);
          
         /* Enable the DMA transfer by setting the DMAEN bit in the ESMC CR register */
         SET_BIT(hesmc->Instance->CR, ESMC_CR_DMAEN);
         /* send command */
         hesmc->Instance->ADDR24 = hesmc->ContexAddr24;         
        }
        else
        {
          status = HAL_ERROR;
          hesmc->ErrorCode |= HAL_ESMC_ERROR_DMA;
          hesmc->State = HAL_ESMC_STATE_READY;

          /* Process unlocked */
          __HAL_UNLOCK(hesmc);
        }
      }
    }
    else
    {
      hesmc->ErrorCode |= HAL_ESMC_ERROR_INVALID_PARAM;
      status = HAL_ERROR;

      /* Process unlocked */
      __HAL_UNLOCK(hesmc);
    }
  }
  else
  {
    status = HAL_BUSY;

    /* Process unlocked */
    __HAL_UNLOCK(hesmc);
  }

  return status;
}

/**
  * @brief  Writes 32-bit buffer to  memory.
  * @param  hesmc pointer to a ESMC_HandleTypeDef structure that contains
  *                the configuration information for ESMC module.
  * @param  pAddress Pointer to write start address
  * @param  pSrcBuffer Pointer to source buffer to write
  * @param  BufferSize Size of the buffer to write to memory
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ESMC_Write_32b(ESMC_HandleTypeDef *hesmc, uint32_t *pAddress, uint32_t *pSrcBuffer,
                                     uint32_t BufferSize)
{
  uint32_t size;
  __IO uint32_t *psramaddress = pAddress;
  uint32_t *psrcbuff = pSrcBuffer;
  HAL_ESMC_StateTypeDef CurrentState = hesmc->State;

  if((CurrentState == HAL_ESMC_STATE_BUSY_MEM_WRITE) || (CurrentState == HAL_ESMC_STATE_BUSY_MEM_WRITEANDMAPPED))
  {
    /* Process Locked */
    __HAL_LOCK(hesmc);

    /* Update the controller state */
    hesmc->State = HAL_ESMC_STATE_BUSY;

    /* Write data to memory */
    for (size=0; size<BufferSize; size++)
    {
      *psramaddress = *psrcbuff;
      psrcbuff++;
      psramaddress++;
    }
    SET_BIT(ESMC->XSSOCR_WE,ESMC_XSSOCR_WE_SS_CLR_RQ);

    /* Update the controller state */
    hesmc->State = CurrentState;

