Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_esmc.c
    /* Process unlocked */
    __HAL_UNLOCK(hesmc);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Writes 16-bit buffer to memory.
  * @param  hesmc pointer to a EMSC_HandleTypeDef structure that contains
  *                the configuration information for ESMC module.
  * @param  pAddress Pointer to write start address
  * @param  pSrcBuffer Pointer to source buffer to write
  * @param  BufferSize Size of the buffer to write to memory
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ESMC_Write_16b(ESMC_HandleTypeDef *hesmc, uint16_t *pAddress, uint16_t *pSrcBuffer,
                                     uint32_t BufferSize)
{
  uint32_t size;
  __IO uint16_t *psramaddress = pAddress;
  uint16_t *psrcbuff = pSrcBuffer;
  HAL_ESMC_StateTypeDef CurrentState = hesmc->State;

  /* Check the controller state */
  if((CurrentState == HAL_ESMC_STATE_BUSY_MEM_WRITE) || (CurrentState == HAL_ESMC_STATE_BUSY_MEM_WRITEANDMAPPED))
  {
    /* Process Locked */
    __HAL_LOCK(hesmc);

    /* Update the controller state */
    hesmc->State = HAL_ESMC_STATE_BUSY;
   
    /* Write data to memory */
    for (size=0; size<BufferSize; size=size+1)
    {
      *(uint16_t*)psramaddress = (uint16_t)(*psrcbuff);
      psramaddress++;
      psrcbuff++;
    }

    SET_BIT(ESMC->XSSOCR_WE,ESMC_XSSOCR_WE_SS_CLR_RQ);

    /* Update the controller state */
    hesmc->State = CurrentState;

    /* Process unlocked */
    __HAL_UNLOCK(hesmc);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Writes 8-bit buffer to memory.
  * @param  hesmc pointer to a ESMC_HandleTypeDef structure that contains
  *                the configuration information for ESMC module.
  * @param  pAddress Pointer to write start address
  * @param  pSrcBuffer Pointer to source buffer to write
  * @param  BufferSize Size of the buffer to write to memory
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_ESMC_Write_8b(ESMC_HandleTypeDef *hesmc, uint8_t *pAddress, uint8_t *pSrcBuffer,
                                     uint32_t BufferSize)
{
  uint32_t size;
  __IO uint8_t *psramaddress = pAddress;
  uint8_t *psrcbuff = pSrcBuffer;
  HAL_ESMC_StateTypeDef CurrentState = hesmc->State;

  /* Check the controller state */
  if((CurrentState == HAL_ESMC_STATE_BUSY_MEM_WRITE) || (CurrentState == HAL_ESMC_STATE_BUSY_MEM_WRITEANDMAPPED))
  {
    /* Process Locked */
    __HAL_LOCK(hesmc);

    /* Update the controller state */
    hesmc->State = HAL_ESMC_STATE_BUSY;
   
    /* Write data to memory */
    for (size=0; size<BufferSize; size=size+1)
    {
      *(uint8_t*)psramaddress = (uint8_t)(*psrcbuff);
      psramaddress++;
      psrcbuff++;
    }

    SET_BIT(ESMC->XSSOCR_WE,ESMC_XSSOCR_WE_SS_CLR_RQ);

    /* Update the controller state */
    hesmc->State = CurrentState;

    /* Process unlocked */
    __HAL_UNLOCK(hesmc);
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief  Transfer Error callbacks
  * @param  hesmc ESMC handle
  * @retval None
  */
__weak void HAL_ESMC_ErrorCallback(ESMC_HandleTypeDef *hesmc)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hesmc);

  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_ESMC_ErrorCallback could be implemented in the user file
   */
}

/**
  * @brief  Abort completed callback.
  * @param  hesmc ESMC handle
  * @retval None
  */
__weak void HAL_ESMC_AbortCpltCallback(ESMC_HandleTypeDef *hesmc)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hesmc);

  /* NOTE: This function should not be modified, when the callback is needed,
           the HAL_ESMC_AbortCpltCallback could be implemented in the user file
   */
}

/**
  * @brief  Command completed callback.
  * @param  hesmc ESMC handle
  * @retval None
  */
__weak void HAL_ESMC_CmdCpltCallback(ESMC_HandleTypeDef *hesmc)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hesmc);

  /* NOTE: This function Should not be modified, when the callback is needed,
           the HAL_ESMC_CmdCpltCallback could be implemented in the user file
   */
}

/**
  * @brief  Rx Transfer completed callbacks.
  * @param  hesmc ESMC handle
  * @retval None
  */
__weak void HAL_ESMC_RxCpltCallback(ESMC_HandleTypeDef *hesmc)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hesmc);

  /* NOTE: This function Should not be modified, when the callback is needed,
           the HAL_ESMC_RxCpltCallback could be implemented in the user file
   */
}

/**
  * @brief  Tx Transfer completed callbacks.
  * @param  hesmc ESMC handle
  * @retval None
  */
__weak void HAL_ESMC_TxCpltCallback(ESMC_HandleTypeDef *hesmc)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hesmc);

  /* NOTE: This function Should not be modified, when the callback is needed,
           the HAL_ESMC_TxCpltCallback could be implemented in the user file
   */
}

/**
  * @brief  Rx Half Block Transfer completed callbacks.
  * @param  hesmc ESMC handle
  * @retval None
  */
__weak void HAL_ESMC_RxHalfBlockCpltCallback(ESMC_HandleTypeDef *hesmc)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hesmc);

  /* NOTE: This function Should not be modified, when the callback is needed,
           the HAL_ESMC_RxHalfCpltCallback could be implemented in the user file
   */
}

/**
  * @brief  Tx Half Block Transfer completed callbacks.
  * @param  hesmc ESMC handle
  * @retval None
  */
__weak void HAL_ESMC_TxHalfBlockCpltCallback(ESMC_HandleTypeDef *hesmc)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hesmc);

  /* NOTE: This function Should not be modified, when the callback is needed,
           the HAL_ESMC_TxHalfCpltCallback could be implemented in the user file
   */
}

#if (USE_HAL_ESMC_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register a User ESMC Callback
  *         To be used instead of the weak (surcharged) predefined callback
  * @param hesmc : ESMC handle
  * @param CallbackId : ID of the callback to be registered
  *        This parameter can be one of the following values:
  *          @arg @ref HAL_ESMC_ERROR_CB_ID          ESMC Error Callback ID
  *          @arg @ref HAL_ESMC_ABORT_CB_ID          ESMC Abort Callback ID
  *          @arg @ref HAL_ESMC_CMD_CPLT_CB_ID       ESMC Command Complete Callback ID
  *          @arg @ref HAL_ESMC_RX_CPLT_CB_ID        ESMC Rx Complete Callback ID
  *          @arg @ref HAL_ESMC_TX_CPLT_CB_ID        ESMC Tx Complete Callback ID
  *          @arg @ref HAL_ESMC_RX_HALFBLOCK_CPLT_CB_ID   ESMC Rx Half Block Complete Callback ID
  *          @arg @ref HAL_ESMC_TX_HALFBLOCK_CPLT_CB_ID   ESMC Tx Half Block Complete Callback ID
  *          @arg @ref HAL_ESMC_MSP_INIT_CB_ID       ESMC MspInit callback ID
  *          @arg @ref HAL_ESMC_MSP_DEINIT_CB_ID     ESMC MspDeInit callback ID
  * @param pCallback : pointer to the Callback function
  * @retval status
  */
HAL_StatusTypeDef HAL_ESMC_RegisterCallback (ESMC_HandleTypeDef *hesmc, HAL_ESMC_CallbackIDTypeDef CallbackId, pESMC_CallbackTypeDef pCallback)
{
  HAL_StatusTypeDef status = HAL_OK;

