Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_esmc.c
  if(pCallback == NULL)
  {
    /* Update the error code */
    hesmc->ErrorCode |= HAL_ESMC_ERROR_INVALID_CALLBACK;
    return HAL_ERROR;
  }

  /* Process locked */
  __HAL_LOCK(hesmc);

  if(hesmc->State == HAL_ESMC_STATE_READY)
  {
    switch (CallbackId)
    {
    case  HAL_ESMC_ERROR_CB_ID :
      hesmc->ErrorCallback = pCallback;
      break;
    case HAL_ESMC_ABORT_CB_ID :
      hesmc->AbortCpltCallback = pCallback;
      break;
    case HAL_ESMC_CMD_CPLT_CB_ID :
      hesmc->CmdCpltCallback = pCallback;
      break;
    case HAL_ESMC_RX_CPLT_CB_ID :
      hesmc->RxCpltCallback = pCallback;
      break;
    case HAL_ESMC_TX_CPLT_CB_ID :
      hesmc->TxCpltCallback = pCallback;
      break;
    case HAL_ESMC_RX_HALFBLOCK_CPLT_CB_ID :
      hesmc->RxHalfBlockCallback = pCallback;
      break;
    case HAL_ESMC_TX_HALFBLOCK_CPLT_CB_ID :
      hesmc->TxHalfBlockCallback = pCallback;
      break;
    case HAL_ESMC_MSP_INIT_CB_ID :
      hesmc->MspInitCallback = pCallback;
      break;
    case HAL_ESMC_MSP_DEINIT_CB_ID :
      hesmc->MspDeInitCallback = pCallback;
      break;
    default :
      /* Update the error code */
      hesmc->ErrorCode |= HAL_ESMC_ERROR_INVALID_CALLBACK;
      /* update return status */
      status =  HAL_ERROR;
      break;
    }
  }
  else if (hesmc->State == HAL_ESMC_STATE_RESET)
  {
    switch (CallbackId)
    {
    case HAL_ESMC_MSP_INIT_CB_ID :
      hesmc->MspInitCallback = pCallback;
      break;
    case HAL_ESMC_MSP_DEINIT_CB_ID :
      hesmc->MspDeInitCallback = pCallback;
      break;
    default :
      /* Update the error code */
      hesmc->ErrorCode |= HAL_ESMC_ERROR_INVALID_CALLBACK;
      /* update return status */
      status =  HAL_ERROR;
      break;
    }
  }
  else
  {
    /* Update the error code */
    hesmc->ErrorCode |= HAL_ESMC_ERROR_INVALID_CALLBACK;
    /* update return status */
    status =  HAL_ERROR;
  }

  /* Release Lock */
  __HAL_UNLOCK(hesmc);
  return status;
}

/**
  * @brief  Unregister a User ESMC Callback
  *         ESMC Callback is redirected to the weak (surcharged) predefined callback
  * @param hesmc : ESMC handle
  * @param CallbackId : ID of the callback to be unregistered
  *        This parameter can be one of the following values:
  *          @arg @ref HAL_ESMC_ERROR_CB_ID          ESMC Error Callback ID
  *          @arg @ref HAL_ESMC_ABORT_CB_ID          ESMC Abort Callback ID
  *          @arg @ref HAL_ESMC_CMD_CPLT_CB_ID       ESMC Command Complete Callback ID
  *          @arg @ref HAL_ESMC_RX_CPLT_CB_ID        ESMC Rx Complete Callback ID
  *          @arg @ref HAL_ESMC_TX_CPLT_CB_ID        ESMC Tx Complete Callback ID
  *          @arg @ref HAL_ESMC_RX_HALFBLOCK_CPLT_CB_ID   ESMC Rx Half Block Callback ID
  *          @arg @ref HAL_ESMC_TX_HALFBLOCK_CPLT_CB_ID   ESMC Tx Half Block Callback ID
  *          @arg @ref HAL_ESMC_MSP_INIT_CB_ID       ESMC MspInit callback ID
  *          @arg @ref HAL_ESMC_MSP_DEINIT_CB_ID     ESMC MspDeInit callback ID
  * @retval status
  */
HAL_StatusTypeDef HAL_ESMC_UnRegisterCallback (ESMC_HandleTypeDef *hesmc, HAL_ESMC_CallbackIDTypeDef CallbackId)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Process locked */
  __HAL_LOCK(hesmc);

  if(hesmc->State == HAL_ESMC_STATE_READY)
  {
    switch (CallbackId)
    {
    case  HAL_ESMC_ERROR_CB_ID :
      hesmc->ErrorCallback = HAL_ESMC_ErrorCallback;
      break;
    case HAL_ESMC_ABORT_CB_ID :
      hesmc->AbortCpltCallback = HAL_ESMC_AbortCpltCallback;
      break;
    case HAL_ESMC_CMD_CPLT_CB_ID :
      hesmc->CmdCpltCallback = HAL_ESMC_CmdCpltCallback;
      break;
    case HAL_ESMC_RX_CPLT_CB_ID :
      hesmc->RxCpltCallback = HAL_ESMC_RxCpltCallback;
      break;
    case HAL_ESMC_TX_CPLT_CB_ID :
      hesmc->TxCpltCallback = HAL_ESMC_TxCpltCallback;
      break;
    case HAL_ESMC_RX_HALFBLOCK_CPLT_CB_ID :
      hesmc->RxHalfBlockCallback = HAL_ESMC_RxHalfBlockCallback;
      break;
    case HAL_ESMC_TX_HALFBLOCK_CPLT_CB_ID :
      hesmc->TxHalfBlockCallback = HAL_ESMC_TxHalfBlockCallback;
      break;
    case HAL_ESMC_MSP_INIT_CB_ID :
      hesmc->MspInitCallback = HAL_ESMC_MspInit;
      break;
    case HAL_ESMC_MSP_DEINIT_CB_ID :
      hesmc->MspDeInitCallback = HAL_ESMC_MspDeInit;
      break;
    default :
      /* Update the error code */
      hesmc->ErrorCode |= HAL_ESMC_ERROR_INVALID_CALLBACK;
      /* update return status */
      status =  HAL_ERROR;
      break;
    }
  }
  else if (hesmc->State == HAL_ESMC_STATE_RESET)
  {
    switch (CallbackId)
    {
    case HAL_ESMC_MSP_INIT_CB_ID :
      hesmc->MspInitCallback = HAL_ESMC_MspInit;
      break;
    case HAL_ESMC_MSP_DEINIT_CB_ID :
      hesmc->MspDeInitCallback = HAL_ESMC_MspDeInit;
      break;
    default :
      /* Update the error code */
      hesmc->ErrorCode |= HAL_ESMC_ERROR_INVALID_CALLBACK;
      /* update return status */
      status =  HAL_ERROR;
      break;
    }
  }
  else
  {
    /* Update the error code */
    hesmc->ErrorCode |= HAL_ESMC_ERROR_INVALID_CALLBACK;
    /* update return status */
    status =  HAL_ERROR;
  }

  /* Release Lock */
  __HAL_UNLOCK(hesmc);
  return status;
}
#endif

/**
  * @}
  */

/** @defgroup ESMC_Exported_Functions_Group3 Peripheral Control and State functions
  *  @brief   ESMC control and State functions
  *
@verbatim
 ===============================================================================
                  ##### Peripheral Control and State functions #####
 ===============================================================================
    [..]
    This subsection provides a set of functions allowing to :
      (+) Check in run-time the state of the driver.
      (+) Check the error code set during last operation.
      (+) Abort any operation.
.....
@endverbatim
  * @{
  */

/**
  * @brief  Return the ESMC handle state.
  * @param  hesmc ESMC handle
  * @retval HAL state
  */
HAL_ESMC_StateTypeDef HAL_ESMC_GetState(ESMC_HandleTypeDef *hesmc)
{
  /* Return ESMC handle state */
  return hesmc->State;
}

/**
* @brief  Return the ESMC error code
* @param  hesmc ESMC handle
* @retval ESMC Error Code
*/
uint32_t HAL_ESMC_GetError(ESMC_HandleTypeDef *hesmc)
{
  return hesmc->ErrorCode;
}

/**
* @brief  Abort the current transmission
* @param  hesmc ESMC handle
* @retval HAL status
*/
HAL_StatusTypeDef HAL_ESMC_Abort(ESMC_HandleTypeDef *hesmc)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t tickstart = HAL_GetTick();

  /* Check if the state is in one of the busy states */
  if ((hesmc->State & 0x2) != 0)
  {
    /* Process unlocked */
    __HAL_UNLOCK(hesmc);

