Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_esmc.c
    if ((hesmc->Instance->CR & ESMC_CR_DMAEN)!= RESET)
    {
      /* Abort DMA channel */
      if (hesmc->State == HAL_ESMC_STATE_BUSY_INDIRECT_RX)
      {
        status = HAL_DMA_Abort(hesmc->hdmarx);
      }
      else if (hesmc->State == HAL_ESMC_STATE_BUSY_INDIRECT_TX)
      {
        status = HAL_DMA_Abort(hesmc->hdmatx);
      }
      /* Disable the DMA transfer by clearing the DMAEN bit in the ESMC CR register */
      CLEAR_BIT(hesmc->Instance->CR, ESMC_CR_DMAEN);

      if(status != HAL_OK)
      {
        hesmc->ErrorCode |= HAL_ESMC_ERROR_DMA;
      }
    }

    /* Disable the slave select, Abort communication */
    __HAL_ESMC_DISABLE_SLAVE(hesmc);

    /* Wait until IDLE flag is set to go back in idle state */
    status = ESMC_WaitFlagStateUntilTimeout(hesmc, ESMC_FLAG_IDLE, SET, tickstart, hesmc->Timeout);

    if(status == HAL_OK)
    {
      /* Update state */
      hesmc->State = HAL_ESMC_STATE_READY;
    }
  }

  return status;
}

/**
* @brief  Abort the current transmission (non-blocking function)
* @param  hesmc ESMC handle
* @retval HAL status
*/
HAL_StatusTypeDef HAL_ESMC_Abort_IT(ESMC_HandleTypeDef *hesmc)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t tickstart = HAL_GetTick();

  /* Check if the state is in one of the busy states */
  if ((hesmc->State & 0x2) != 0)
  {
    /* Process unlocked */
    __HAL_UNLOCK(hesmc);

    /* Disable global interrupts */
    __HAL_ESMC_DISABLE_GLOBAL_IT(hesmc);
    /* Disable all interrupts */
    __HAL_ESMC_DISABLE_IT(hesmc, ESMC_IT_ALL);

    if ((hesmc->Instance->CR & ESMC_CR_DMAEN)!= RESET)
    {
      /* Abort DMA channel */
      hesmc->hdmarx->XferAbortCallback = ESMC_DMAAbortCplt;
      if (hesmc->State == HAL_ESMC_STATE_BUSY_INDIRECT_RX)
      {
        status = HAL_DMA_Abort_IT(hesmc->hdmarx);
      }
      else if (hesmc->State == HAL_ESMC_STATE_BUSY_INDIRECT_TX)
      {
        status = HAL_DMA_Abort_IT(hesmc->hdmarx);
      }
      /* Disable the DMA transfer by clearing the DMAEN bit in the ESMC CR register */
      CLEAR_BIT(hesmc->Instance->CR, ESMC_CR_DMAEN);
      if (status != HAL_OK)
      {
        /* Change state of ESMC */
        hesmc->State = HAL_ESMC_STATE_READY;

        /* Abort Complete callback */
#if (USE_HAL_ESMC_REGISTER_CALLBACKS == 1)
        hesmc->AbortCpltCallback(hesmc);
#else
        HAL_ESMC_AbortCpltCallback(hesmc);
#endif
      }
    }

    /* Disable the slave select, Abort communication */
    __HAL_ESMC_DISABLE_SLAVE(hesmc);

    /* Wait until IDLE flag is set to go back in idle state */
    status = ESMC_WaitFlagStateUntilTimeout(hesmc, ESMC_FLAG_IDLE, SET, tickstart, hesmc->Timeout);

    if(status == HAL_OK)
    {
      /* Update state */
      hesmc->State = HAL_ESMC_STATE_READY;
    }
  }

  return status;
}

/** @brief Set ESMC timeout
  * @param  hesmc ESMC handle.
  * @param  Timeout Timeout for the ESMC memory access.
  * @retval None
  */
void HAL_ESMC_SetTimeout(ESMC_HandleTypeDef *hesmc, uint32_t Timeout)
{
  hesmc->Timeout = Timeout;
}


/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/

/**
  * @brief  DMA ESMC receive process complete callback.
  * @param  hdma DMA handle
  * @retval None
  */
static void ESMC_DMARxCplt(DMA_HandleTypeDef *hdma)
{
  ESMC_HandleTypeDef* hesmc = ( ESMC_HandleTypeDef* )((DMA_HandleTypeDef* )hdma)->Parent;
  hesmc->RxXferCount = 0;

  /* Disable the DMA transfer by clearing the DMAEN bit in the ESMC CR register */
  CLEAR_BIT(hesmc->Instance->CR, ESMC_CR_DMAEN);

  if (hesmc->Contex == ESMC_CONTEXT_READ_VARIABLE_LENGTH)
  {
    /* Disable the slave select */
    __HAL_ESMC_DISABLE_SLAVE(hesmc);
  }

  /* Change state of ESMC */
  hesmc->State = HAL_ESMC_STATE_READY;

  /* Restore default values */
  hesmc->Contex = ESMC_CONTEXT_NONE;
}

/**
  * @brief  DMA ESMC transmit process complete callback.
  * @param  hdma DMA handle
  * @retval None
  */
static void ESMC_DMATxCplt(DMA_HandleTypeDef *hdma)
{
  ESMC_HandleTypeDef* hesmc = ( ESMC_HandleTypeDef* )((DMA_HandleTypeDef* )hdma)->Parent;
  hesmc->TxXferCount = 0;

  /* Enable the ESMC Interrupt */
  __HAL_ESMC_ENABLE_GLOBAL_IT(hesmc);
  if (hesmc->Contex == ESMC_CONTEXT_WRITE_FIXED_LENGTH)
  {
    __HAL_ESMC_ENABLE_IT(hesmc, ESMC_IT_IDLEDONE);
  } 
  else
  {
    __HAL_ESMC_ENABLE_IT(hesmc, ESMC_IT_DATAWAIT);
  }
}

/**
  * @brief  DMA ESMC receive process half block complete callback
  * @param  hdma  DMA handle
  * @retval None
  */
static void ESMC_DMARxHalfBlockCplt(DMA_HandleTypeDef *hdma)
{
  ESMC_HandleTypeDef* hesmc = (ESMC_HandleTypeDef*)((DMA_HandleTypeDef*)hdma)->Parent;

#if (USE_HAL_ESMC_REGISTER_CALLBACKS == 1)
  hesmc->RxHalfCpltCallback(hesmc);
#else
  HAL_ESMC_RxHalfBlockCpltCallback(hesmc);
#endif
}

/**
  * @brief  DMA ESMC transmit process half block complete callback
  * @param  hdma  DMA handle
  * @retval None
  */
static void ESMC_DMATxHalfBlockCplt(DMA_HandleTypeDef *hdma)
{
  ESMC_HandleTypeDef* hesmc = (ESMC_HandleTypeDef*)((DMA_HandleTypeDef*)hdma)->Parent;

#if (USE_HAL_ESMC_REGISTER_CALLBACKS == 1)
  hesmc->TxHalfCpltCallback(hesmc);
#else
  HAL_ESMC_TxHalfBlockCpltCallback(hesmc);
#endif
}

/**
  * @brief  DMA ESMC communication error callback.
  * @param  hdma DMA handle
  * @retval None
  */
static void ESMC_DMAError(DMA_HandleTypeDef *hdma)
{
  ESMC_HandleTypeDef* hesmc = ( ESMC_HandleTypeDef* )((DMA_HandleTypeDef* )hdma)->Parent;

  hesmc->RxXferCount = 0;
  hesmc->TxXferCount = 0;
  hesmc->ErrorCode   |= HAL_ESMC_ERROR_DMA;

  /* Disable the DMA transfer by clearing the DMAEN bit in the ESMC CR register */
  CLEAR_BIT(hesmc->Instance->CR, ESMC_CR_DMAEN);

  /* Abort the ESMC */
  HAL_ESMC_Abort_IT(hesmc);

}

/**
  * @brief  DMA ESMC abort complete callback.
  * @param  hdma DMA handle
  * @retval None
  */
static void ESMC_DMAAbortCplt(DMA_HandleTypeDef *hdma)
{
  ESMC_HandleTypeDef* hesmc = ( ESMC_HandleTypeDef* )((DMA_HandleTypeDef* )hdma)->Parent;

  hesmc->RxXferCount = 0;
  hesmc->TxXferCount = 0;

  if(hesmc->State == HAL_ESMC_STATE_ABORT)
  {

