Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_esmc.c
  }
  else
  {
    /* DMA Abort called due to a transfer error interrupt */
    /* Change state of ESMC */
    hesmc->State = HAL_ESMC_STATE_READY;

    /* Error callback */
#if (USE_HAL_ESMC_REGISTER_CALLBACKS == 1)
    hesmc->ErrorCallback(hesmc);
#else
    HAL_ESMC_ErrorCallback(hesmc);
#endif
  }
}

/**
  * @brief  Wait for a flag state until timeout.
  * @param  hesmc ESMC handle
  * @param  Flag Flag checked
  * @param  State Value of the flag expected
  * @param  tickstart Start tick value
  * @param  Timeout Duration of the time out
  * @retval HAL status
  */
HAL_StatusTypeDef ESMC_WaitFlagStateUntilTimeout(ESMC_HandleTypeDef *hesmc, uint32_t Flag,
    FlagStatus State, uint32_t tickstart, uint32_t Timeout)
{
  /* Wait until flag is in expected state */
  while((__HAL_ESMC_GET_FLAG(hesmc, Flag)) != State)
  {
    /* Check for the Timeout */
    if (Timeout != HAL_MAX_DELAY)
    {
      if((Timeout == 0) || ((HAL_GetTick() - tickstart) > Timeout))
      {
        hesmc->State     = HAL_ESMC_STATE_ERROR;
        hesmc->ErrorCode |= HAL_ESMC_ERROR_TIMEOUT;

        return HAL_ERROR;
      }
    }
  }
  return HAL_OK;
}

/**
  * @brief  Configure the communication registers.
  * @param  hesmc ESMC handle
  * @param  cmd structure that contains the command configuration information
  * @param  FunctionalMode functional mode to configured
  *           This parameter can be one of the following values:
  *            @arg ESMC_FUNCTIONAL_MODE_INDIRECT_INSTRUCT: Instruct mode
  *            @arg ESMC_FUNCTIONAL_MODE_INDIRECT_READ_WRITE: write/read mode
  *            @arg ESMC_FUNCTIONAL_MODE_MEMORY_MAPPED: Memory Read
  *            @arg ESMC_FUNCTIONAL_MODE_MEMORY_WRITE: Memory Write
  * @retval None
  */
static void ESMC_Config(ESMC_HandleTypeDef *hesmc, ESMC_CommandTypeDef *cmd, uint32_t FunctionalMode)
{
  uint32_t TmpCR3 =0;
  uint32_t TmpSOCR = 0;
  uint32_t TmpDCR = 0;
  uint32_t TmpADDR24 = 0;
  uint32_t TmpADDR32 = 0;
  uint32_t TmpSFCR = 0;
  uint32_t TmpSTRR = 0;

  uint32_t TmpXSFCR =0;
  uint32_t TmpXSOCR = 0;
  uint32_t TmpXSSOCR = 0;
  uint32_t TmpXDCR = 0;
  uint32_t TmpXCR3 = 0;
  uint32_t TmpXMODE = 0;
  uint32_t TmpXSTRR = 0;

  uint32_t TmpXSFCR_WE = 0;
  uint32_t TmpXSOCR_WE = 0;
  uint32_t TmpXSSOCR_WE = 0;
  uint32_t TmpXDCR_WE = 0;
  uint32_t TmpXMODE_WE = 0;
  uint32_t TmpXCR3_WE = 0;

  assert_param(IS_ESMC_FUNCTIONAL_MODE(FunctionalMode));

  if(cmd->XspiDualLatency == ESMC_XSPI_DUALLATENCY_DISABLE)
  {
    SET_BIT(hesmc->Instance->CR2,ESMC_CR2_XSPI_DUAL_LAT_OFF);
  }
  else
  {
    CLEAR_BIT(hesmc->Instance->CR2,ESMC_CR2_XSPI_DUAL_LAT_OFF);
  }
  if (FunctionalMode == ESMC_FUNCTIONAL_MODE_INDIRECT_INSTRUCT)
  {
    /* Disable the slave select by default */
    __HAL_ESMC_DISABLE_SLAVE(hesmc);

    /* clear fifo */
    __HAL_ESMC_CLEAR_FIFO(hesmc);

    TmpCR3 = hesmc->Instance->CR3;
    TmpSOCR = hesmc->Instance->SOCR;
    TmpDCR = hesmc->Instance->DCR;
    TmpADDR24 = hesmc->Instance->ADDR24;
    TmpADDR32 = hesmc->Instance->ADDR32;

    /* configure spi transfer format, instruction operation mode and DDR mode */
    MODIFY_REG(TmpSOCR, (ESMC_SOCR_SPIMODE | ESMC_SOCR_DDRADDR | ESMC_SOCR_DDRCMD | ESMC_SOCR_DDRDATA), \
               (cmd->TransferFormat | cmd->DdrMode));

    /* Set Instruction Mode */
    if (cmd->InstructionMode  == ESMC_INSTRUCTION_MULTI_LINES)
    {
      SET_BIT(TmpSOCR, ESMC_SOCR_MULTICMD);
    } 
    else
    {
      CLEAR_BIT(TmpSOCR, ESMC_SOCR_MULTICMD);
    }
 
    /* Set Instruction Length */
    if(cmd->InstrcutionLen == ESMC_INSTRCUTION_LEN_2_BYTE)
    {
      /* Set the Second Command */
      SET_BIT(TmpCR3,ESMC_CR3_CMD_EXT);
      MODIFY_REG(TmpADDR32,ESMC_ADDR32_MREG,(cmd->Instruction & ESMC_ADDR32_MREG));
    }
    else
    {
      /* Clear the Second Commnad */ 
      CLEAR_BIT(TmpCR3,ESMC_CR3_CMD_EXT);
      CLEAR_BIT(TmpADDR32,ESMC_ADDR32_MREG);
    }

    /* Set Command */
    CLEAR_BIT(TmpDCR, ESMC_DCR_NO_CMD); 

    /* Set NO ADDR/DATA */
    SET_BIT(TmpCR3, ESMC_CR3_NO_ADDR | ESMC_CR3_NO_DATA);

    /* configure slave select output */
    MODIFY_REG(TmpADDR32, ESMC_ADDR32_SSXO, (cmd->CSPinSel) << ESMC_ADDR32_SSXO_Pos);

    /* Modify DQS */
    MODIFY_REG(TmpCR3,ESMC_CR3_XSPI_RWDS,cmd->DQSMode); 

    /* Set Instruction */
    WRITE_REG(TmpSFCR,(cmd->Instruction)&ESMC_SFCR_SFCR0);

    /* write config values to register */
    WRITE_REG(hesmc->Instance->CR3, TmpCR3);
    WRITE_REG(hesmc->Instance->SOCR, TmpSOCR);
    WRITE_REG(hesmc->Instance->DCR, TmpDCR);
    WRITE_REG(hesmc->Instance->ADDR32, TmpADDR32);
    WRITE_REG(hesmc->Instance->SFCR, TmpSFCR);
  }
  else if (FunctionalMode == ESMC_FUNCTIONAL_MODE_INDIRECT_READ_WRITE)
  {
    /* Disable the slave select by default */
    __HAL_ESMC_DISABLE_SLAVE(hesmc);

    /* clear fifo */
    __HAL_ESMC_CLEAR_FIFO(hesmc);

    TmpCR3 = hesmc->Instance->CR3;
    TmpSOCR = hesmc->Instance->SOCR;
    TmpDCR = hesmc->Instance->DCR;

    TmpADDR24 = hesmc->Instance->ADDR24;
    TmpADDR32 = hesmc->Instance->ADDR32;
      
    /* configure spi transfer format, instruction operation mode and DDR mode */
    MODIFY_REG(TmpSOCR, (ESMC_SOCR_SPIMODE | ESMC_SOCR_DDRADDR | ESMC_SOCR_DDRCMD | ESMC_SOCR_DDRDATA), \
               (cmd->TransferFormat | cmd->DdrMode));

    /* config command region */
    if (cmd->InstructionMode != ESMC_INSTRUCTION_NONE)
    {
      CLEAR_BIT(TmpDCR, ESMC_DCR_NO_CMD);
      if (cmd->InstructionMode  == ESMC_INSTRUCTION_MULTI_LINES)
      {
        SET_BIT(TmpSOCR, ESMC_SOCR_MULTICMD);
      } 
      else
      {
        CLEAR_BIT(TmpSOCR, ESMC_SOCR_MULTICMD);
      }
      /* set command value */
      MODIFY_REG(TmpADDR24, ESMC_ADDR24_INS1, (uint8_t)((cmd->Instruction)&ESMC_ADDR24_INS1));
    } 
    else
    {
      /* No instruction and begin with Address */
      SET_BIT(TmpDCR, ESMC_DCR_NO_CMD);
    }
 
    if(cmd->InstrcutionLen == ESMC_INSTRCUTION_LEN_2_BYTE)
    {
      SET_BIT(TmpCR3,ESMC_CR3_CMD_EXT);
      MODIFY_REG(TmpADDR32,ESMC_ADDR32_MREG,(cmd->Instruction & ESMC_ADDR32_MREG));
    }
    else
    {
      CLEAR_BIT(TmpCR3,ESMC_CR3_CMD_EXT);
    }
     
    /* config address region */
    if (cmd->AddressMode != ESMC_ADDRESS_NONE)
    {
      CLEAR_BIT(TmpCR3,ESMC_CR3_NO_ADDR);

      if ((cmd->AddressMode == ESMC_ADDRESS_MULTI_LINES) || \
          (cmd->InstructionMode  == ESMC_INSTRUCTION_MULTI_LINES))
      {
        SET_BIT(TmpSOCR, ESMC_SOCR_MULTIADDR);
      } 
      else
      {
        CLEAR_BIT(TmpSOCR, ESMC_SOCR_MULTIADDR);
      }
       
      /* Modify Address Size */
      MODIFY_REG(TmpCR3, (ESMC_CR3_ADDR8BIT | ESMC_CR3_ADDR16BIT | ESMC_CR3_ADDR32BIT), cmd->AddressSize);

      /* Set Address Value */
      if (cmd->AddressSize == ESMC_ADDRESS_32_BITS)
      {
        MODIFY_REG(TmpADDR32, ESMC_ADDR32_ADDR3, ((cmd->Address >> 24) & ESMC_ADDR32_ADDR3));
      }
      /* Set Address Value */
      MODIFY_REG(TmpADDR24, (ESMC_ADDR24_ADDR0 | ESMC_ADDR24_ADDR1 | ESMC_ADDR24_ADDR2), \
                 ((cmd->Address & 0x00FFFFFF) << ESMC_ADDR24_ADDR0_Pos));
    } 
    else
    {
      SET_BIT(TmpCR3, ESMC_CR3_NO_ADDR);     
    }

    /* Config Alternate region */
    if (cmd->AlternateByteMode == ESMC_ALTERNATE_BYTES_ENABLE)
    {
      /* Set Alternate byte */
      MODIFY_REG(TmpADDR32, ESMC_ADDR32_MREG, cmd->AlternateByte<<ESMC_ADDR32_MREG_Pos);
      SET_BIT(TmpSOCR, ESMC_SOCR_SENM);
    } 
    else
    {
      /* Clear Alternate byte */
      CLEAR_BIT(TmpSOCR, ESMC_SOCR_SENM);
    }

