Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_esmc.c
    /* config dummy region */
    MODIFY_REG(TmpDCR, ESMC_DCR_DUMMY, cmd->DummyCycles);

    /* configure slave select output */
    MODIFY_REG(TmpADDR32, ESMC_ADDR32_SSXO, (cmd->CSPinSel) << ESMC_ADDR32_SSXO_Pos);

    MODIFY_REG(TmpCR3,ESMC_CR3_XSPI_RWDS,cmd->DQSMode);

    /* config data region */
    if ((cmd->DataMode == ESMC_DATA_WRITE) && (cmd->NbData != 0))
    {
      /* set write mode */
      CLEAR_BIT(TmpDCR, ESMC_DCR_REC);
      if (cmd->NbData >= HAL_ESMC_TCR_MAX_LENGTH)
      {
        /* Read/write of undefined number of data bytes from/to FLASH */
        WRITE_REG(hesmc->Instance->BCR, 0);
        hesmc->Contex = ESMC_CONTEXT_WRITE_VARIABLE_LENGTH;
      } 
      else
      {
        /* Read/write specified number of data bytes from/to FLASH */
        WRITE_REG(hesmc->Instance->BCR, cmd->NbData);
        hesmc->Contex = ESMC_CONTEXT_WRITE_FIXED_LENGTH;
      }

      /* Configure counters and size of the handle */
      hesmc->TxXferCount = cmd->NbData;
      hesmc->TxXferSize  = cmd->NbData;
    }
    else if ((cmd->DataMode == ESMC_DATA_READ) && (cmd->NbData != 0))
    {
      /* set read mode */
      SET_BIT(TmpDCR, ESMC_DCR_REC);
      if (cmd->NbData >= HAL_ESMC_TCR_MAX_LENGTH)
      {
        /* Read/write of undefined number of data bytes from/to FLASH */
        WRITE_REG(hesmc->Instance->BCR, 0);
        hesmc->Contex = ESMC_CONTEXT_READ_VARIABLE_LENGTH;
      } 
      else
      {
        /* Read/write specified number of data bytes from/to FLASH */
        WRITE_REG(hesmc->Instance->BCR, cmd->NbData);
        hesmc->Contex = ESMC_CONTEXT_READ_FIXED_LENGTH;
      }

      /* Configure counters and size of the handle */
      hesmc->RxXferCount = cmd->NbData;
      hesmc->RxXferSize  = cmd->NbData;
    } 
    else
    {
      CLEAR_BIT(TmpDCR, ESMC_DCR_REC);

      WRITE_REG(hesmc->Instance->BCR, 0);

      /* Restore default values */
      hesmc->Contex = ESMC_CONTEXT_NONE;
    }

    /* Set Sample Shifting */
    WRITE_REG(TmpSTRR,cmd->SampleShifting);

    WRITE_REG(hesmc->Instance->ADDR32, TmpADDR32);
    WRITE_REG(hesmc->Instance->SOCR, TmpSOCR);
    WRITE_REG(hesmc->Instance->DCR, TmpDCR);
    WRITE_REG(hesmc->Instance->STRR,TmpSTRR);

    if (cmd->DataMode != ESMC_DATA_NONE)
    {
      CLEAR_BIT(TmpCR3,ESMC_CR3_NO_DATA);
      WRITE_REG(hesmc->Instance->CR3, TmpCR3);
      hesmc->ContexAddr24 = TmpADDR24;
    } 
    else
    {
      SET_BIT(TmpCR3,ESMC_CR3_NO_DATA);
      WRITE_REG(hesmc->Instance->CR3, TmpCR3);
      WRITE_REG(hesmc->Instance->ADDR24, TmpADDR24);
    }
  } 
  else if (FunctionalMode == ESMC_FUNCTIONAL_MODE_MEMORY_MAPPED)
  {
    __HAL_ESMC_DISABLE_SLAVE(hesmc);
    __HAL_ESMC_CLEAR_FIFO(hesmc);

    TmpXSFCR = hesmc->Instance->XSFCR;
    TmpXSOCR = hesmc->Instance->XSOCR;
    TmpXDCR  = hesmc->Instance->XDCR;
    TmpXCR3 = hesmc->Instance->XCR3;
    TmpXMODE = hesmc->Instance->XMODE;
    TmpXSSOCR = hesmc->Instance->XSSOCR;

    /* configure spi transfer format, instruction operation mode and DDR mode */
    MODIFY_REG(TmpXSOCR, (ESMC_SOCR_SPIMODE | ESMC_XSOCR_DDRCMD | ESMC_XSOCR_DDRADDR | ESMC_XSOCR_DDRDATA), \
               (cmd->TransferFormat | cmd->DdrMode));

    /* Config Instruction Mode */
    if (cmd->InstructionMode != ESMC_INSTRUCTION_NONE)
    {
      CLEAR_BIT(TmpXDCR, ESMC_XDCR_NO_CMD);
      if (cmd->InstructionMode  == ESMC_INSTRUCTION_MULTI_LINES)
      {
        SET_BIT(TmpXSOCR, ESMC_XSOCR_MULTICMD);
      } 
      else
      {
        CLEAR_BIT(TmpXSOCR, ESMC_XSOCR_MULTICMD);
      }
    }
    else
    {
      SET_BIT(TmpXDCR, ESMC_XDCR_NO_CMD);
      CLEAR_BIT(TmpXSOCR, ESMC_XSOCR_MULTICMD);
    }

    /* Config Instruction Length */
    if(cmd->InstrcutionLen == ESMC_INSTRCUTION_LEN_2_BYTE)
    {
      SET_BIT(TmpXCR3, ESMC_XCR3_CMD_EXT);
      MODIFY_REG(TmpXMODE,ESMC_XMODE_XMODE,(uint8_t)((cmd->Instruction>>8)&ESMC_XMODE_XMODE));
    }
    else
    {
      CLEAR_BIT(TmpXCR3,ESMC_XCR3_CMD_EXT);
      CLEAR_BIT(TmpXMODE,ESMC_XMODE_XMODE);
    }

    /* config address region */
    CLEAR_BIT(TmpXDCR, ESMC_XCR3_NO_ADDR);

    if ((cmd->AddressMode == ESMC_ADDRESS_MULTI_LINES) || \
        (cmd->InstructionMode  == ESMC_INSTRUCTION_MULTI_LINES))
    {
      SET_BIT(TmpXSOCR, ESMC_XSOCR_MULTIADDR);
    } 
    else
    {
      CLEAR_BIT(TmpXSOCR, ESMC_XSOCR_MULTIADDR);
    }

    /* Config Address Size */
    MODIFY_REG(TmpXCR3, (ESMC_XCR3_ADDR8BIT | ESMC_XCR3_ADDR16BIT | ESMC_XCR3_ADDR32BIT), cmd->AddressSize);

    /* Config Alternate region */
    if (cmd->AlternateByteMode == ESMC_ALTERNATE_BYTES_ENABLE)
    {
      /* Config alternate byte */
      MODIFY_REG(TmpXMODE, ESMC_XMODE_XMODE, cmd->AlternateByte);
      SET_BIT(TmpXSOCR, ESMC_XSOCR_SEND_M);
    } 
    else
    {
      CLEAR_BIT(TmpXSOCR, ESMC_XSOCR_SEND_M);
    }
      
    /* Config Dummy Cycles */
    MODIFY_REG(TmpXDCR, ESMC_XDCR_XDUMMY, cmd->DummyCycles);

    /* Config CS */
    MODIFY_REG(TmpXSSOCR, ESMC_XSSOCR_SSXO, cmd->CSPinSel);

    /* Config DQS Mode */
    MODIFY_REG(TmpXCR3,ESMC_XCR3_XSPI_RWDS,cmd->DQSMode); 

    /* Config Instrction */
    WRITE_REG(TmpXSFCR,(uint8_t)(cmd->Instruction & ESMC_XSFCR_XINS));

    /* Config Sample Shifting */
    WRITE_REG(TmpXSTRR,cmd->SampleShifting);

    WRITE_REG(hesmc->Instance->XCR3, TmpXCR3);   
    WRITE_REG(hesmc->Instance->XSSOCR, TmpXSSOCR);
    WRITE_REG(hesmc->Instance->XSOCR, TmpXSOCR);
    WRITE_REG(hesmc->Instance->XDCR, TmpXDCR);
    WRITE_REG(hesmc->Instance->XMODE, TmpXMODE);
    WRITE_REG(hesmc->Instance->XSTRR,TmpXSTRR);

    if (cmd->InstructionMode != ESMC_INSTRUCTION_NONE)
    {
      WRITE_REG(hesmc->Instance->XSFCR, TmpXSFCR);
    }  
  }
  else if (FunctionalMode == ESMC_FUNCTIONAL_MODE_MEMORY_WRITE)
  { 
    /* Disable the slave select by default */
    __HAL_ESMC_DISABLE_SLAVE(hesmc);

    /* clear fifo */
    __HAL_ESMC_CLEAR_FIFO(hesmc);

    TmpXMODE_WE = hesmc->Instance->XMODE_WE;
    TmpXSSOCR_WE = hesmc->Instance->XSSOCR_WE;
    TmpXSFCR_WE = hesmc->Instance->XSFCR_WE;
    TmpXSOCR_WE = hesmc->Instance->XSOCR_WE;
    TmpXDCR_WE  = hesmc->Instance->XDCR_WE;
    TmpXCR3_WE = hesmc->Instance->XCR3_WE;
 
    /* configure spi transfer format, instruction operation mode and DDR mode */
    MODIFY_REG(TmpXSOCR_WE, (ESMC_XSOCR_WE_SPI_MODE | ESMC_XSOCR_WE_DDRADDR | ESMC_XSOCR_WE_DDRCMD | ESMC_XSOCR_WE_DDRDATA), \
               (cmd->TransferFormat | cmd->DdrMode));

