Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Src/py32e407_hal_esmc.c
    /* config command region */
    if (cmd->InstructionMode != ESMC_INSTRUCTION_NONE)
    {
      WRITE_REG(TmpXSFCR_WE, cmd->Instruction);

      CLEAR_BIT(TmpXDCR_WE, ESMC_XDCR_WE_NO_CMD);

      if (cmd->InstructionMode  == ESMC_INSTRUCTION_MULTI_LINES)
      {
        SET_BIT(TmpXSOCR_WE, ESMC_XSOCR_WE_MULTICMD);
      } 
      else
      {
        CLEAR_BIT(TmpXSOCR_WE, ESMC_XSOCR_WE_MULTICMD);
      }
    }
    else
    {
      /* no instruction and begin with Address */
      SET_BIT(TmpXDCR_WE, ESMC_XDCR_WE_NO_CMD);
    }
    
    if(cmd->InstrcutionLen == ESMC_INSTRCUTION_LEN_2_BYTE)
    {
      SET_BIT(TmpXCR3_WE,ESMC_XCR3_WE_CMD_EXT);
      MODIFY_REG(TmpXMODE_WE,ESMC_XMODE_WE_XMODE_WE,(cmd->Instruction>>8)&ESMC_XMODE_WE_XMODE_WE);
    }
    else
    {
       CLEAR_BIT(TmpXCR3_WE,ESMC_XCR3_WE_CMD_EXT);
       CLEAR_BIT(TmpXMODE_WE,ESMC_XMODE_WE_XMODE_WE);
    }

    /* config address region */
    CLEAR_BIT(TmpXDCR_WE, ESMC_XCR3_WE_NO_ADDR);

    if (cmd->AddressMode == ESMC_ADDRESS_MULTI_LINES)
    {
      SET_BIT(TmpXSOCR_WE, ESMC_XSOCR_WE_MULTIADDR);
    } 
    else
    {
      CLEAR_BIT(TmpXSOCR_WE, ESMC_XSOCR_WE_MULTIADDR);
    }

    /* Condig Address Size */
    MODIFY_REG(TmpXCR3_WE, (ESMC_XCR3_WE_ADDR8BIT | ESMC_XCR3_WE_ADDR16BIT | ESMC_XCR3_WE_ADDR32BIT), cmd->AddressSize);

    /* Config Alternate Region */
    if (cmd->AlternateByteMode == ESMC_ALTERNATE_BYTES_ENABLE)
    {
      /* configure alternate byte */
      MODIFY_REG(TmpXMODE_WE, ESMC_XMODE_WE_XMODE_WE, cmd->AlternateByte);
      SET_BIT(TmpXSOCR_WE, ESMC_XSOCR_WE_SEND_M);
    } 
    else
    {
      CLEAR_BIT(TmpXSOCR_WE, ESMC_XSOCR_WE_SEND_M);
    }

    /* Config Dummy Cycles */
    MODIFY_REG(TmpXDCR_WE, ESMC_XDCR_XDUMMY, cmd->DummyCycles);
   
    /* Config CS */
    MODIFY_REG(TmpXSSOCR_WE, ESMC_XSSOCR_WE_SSXO, (cmd->CSPinSel) << ESMC_XSSOCR_WE_SSXO_Pos);

    /* Config DQS */
    MODIFY_REG(TmpXCR3_WE,ESMC_XCR3_XSPI_RWDS,cmd->DQSMode); 

    /* write register */
    WRITE_REG(hesmc->Instance->XSOCR_WE, TmpXSOCR_WE);
    WRITE_REG(hesmc->Instance->XDCR_WE, TmpXDCR_WE);
    WRITE_REG(hesmc->Instance->XMODE_WE, TmpXMODE_WE);
    WRITE_REG(hesmc->Instance->XCR3_WE, TmpXCR3_WE);
    WRITE_REG(hesmc->Instance->XSSOCR_WE, TmpXSSOCR_WE);
    WRITE_REG(hesmc->Instance->XSFCR_WE, TmpXSFCR_WE);
  }
}

/**
  * @brief  Write data to FIFO.
  * @param  hesmc ESMC handle
  * @param  pData Data buffer pointer
  * @param  dataLen Number of bytes to be written
  * @retval None
  */
void ESMC_WriteBuff(ESMC_HandleTypeDef *hesmc, uint8_t *pData, uint8_t dataLen)
{
  uint8_t len32 = (dataLen & 0xFC) >> 2;
  uint8_t len8 = dataLen & 0x03;
  uint8_t i = 0 ;
  uint32_t data = 0;
  __IO uint8_t *data_reg8 = (uint8_t *)(&hesmc->Instance->DATA);

  for(i=0; i<len32; i++)
  {
    data = (uint32_t)(*pData++);
    data |= ((uint32_t)(*pData++) << 8);
    data |= ((uint32_t)(*pData++) << 16);
    data |= ((uint32_t)(*pData++) << 24);
    hesmc->Instance->DATA = data;
  }

  for(i=0; i<len8; i++)
  {
    *data_reg8 = *pData++;
  }
}

/**
  * @brief  Write data to FIFO.
  * @param  hesmc ESMC handle
  * @param  pData Data buffer pointer
  * @param  dataLen Number of bytes to be written
  * @retval None
  */
void ESMC_ReadBuff(ESMC_HandleTypeDef *hesmc, uint8_t *pData, uint8_t dataLen)
{
  uint8_t len32 = (dataLen & 0xFC) >> 2;
  uint8_t len8 = dataLen & 0x03;
  uint8_t i;
  uint32_t data;
  
  for(i=0; i<len32; i++)
  {
    data = hesmc->Instance->DATA;
    *pData++ = (uint8_t)(data & 0xFFU);
    *pData++ = (uint8_t)((data >> 8U) & 0xFFU);
    *pData++ = (uint8_t)((data >> 16U) & 0xFFU);
    *pData++ = (uint8_t)((data >> 24U) & 0xFFU);
  }

  if (len8 != 0)
  {
    data = hesmc->Instance->DATA;
    while (len8--)
    {
      *pData++ = (uint8_t)(data & 0xFFU);
      data >>= 8;
    }
  }
}

/**
  * @}
  */

#endif /* HAL_ESMC_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT Puya *****END OF FILE******************/
